[
  {
    "supplier": "Interloop Limited",
    "title": "Just Style Excellence Awards 2024: Interloop Limited",
    "link": "https://www.just-style.com/featured-company/2024-interloop/",
    "published": "2024-07-04T04:25:38.000Z",
    "text": "Interloop is based in Pakistan and is a Category Award Winner in the 2024 Just Style Excellence Awards Interloop, a multi-category manufacturer based in Pakistan, has won three awards in the 2024 Just Style Excellence Awards, in the Business Expansion, Innovation, and Environmental categories, for expanding its manufacturing capacity and efficiency, and for introducing new product offerings with a core focus on sustainability and traceability across its value chain. The Just Style Excellence Awards celebrate the greatest achievements and innovations in the industry. Powered by the business intelligence of GlobalData, the programme provides a platform to recognise the people and companies that are driving change. \n                        The gold standard of business intelligence.\n                     \n                            Find out more\n                            \n\n\n\n Interloop unveiled a cutting-edge apparel manufacturing facility in Faisalabad, significantly enhancing its knitted apparel production capabilities to an annual output of 45 million pieces. Launched in November 2023, the facility is part of the expansive Interloop Apparel Park, the company’s most sophisticated complex featuring vertically integrated operations. The development has not only augmented Interloop’s production capacity but also its operational efficiency, boasting a daily production capacity of 50 tonnes across knitting and dyeing processes. Spanning 232 acres, the Apparel Park serves as a hub for diverse manufacturing processes, centralised sustainability efforts, and ancillary services. The park’s infrastructure encompasses a hosiery factory, a vocational training centre for workforce development, a biodiversity park, a biomass boiler facility, and an advanced water recycling system. These elements are a testament to Interloop’s unwavering commitment to environmental sustainability and operational excellence on a large industrial scale. Download our full 90+ page Awards Report, which contains all Excellence and Category Winners, Featured Winner Profiles and the Country Winner Breakdown Interloop is championing the use of alternative, sustainable materials by converting waste into valuable resources within its production cycle. A prime example of this innovative approach is the creation of a bio-based material that repurposes banana agricultural by-products into a usable textile fibre. The groundbreaking material, branded as Loomshake™ yarn, has been integrated into Interloop’s product lines, including denim, hosiery, and other apparel items. Loomshake™ has earned certifications from Oeko-tex and ISCC plus, and its adoption has been well-received in the market, with successful applications in hosiery by Dinner Service NY and in denim by GUESS INC. Interloop’s proactive approach to sustainability has earned it global recognition as a responsible manufacturer. The company’s achievements include several LEED-certified facilities, with its 5th Hosiery Plant being awarded LEED Gold certification. Interloop’s commitment to ethical practices is further evidenced by its adherence to Fair Trade principles and active participation in the United Nations Global Compact.  The company’s ESG framework is robust and data-driven, allowing for precise measurement of its environmental impact. Interloop is proud to be the first major Pakistani enterprise to have its Science Based Targets validated by the SBTi, reflecting its leadership in climate action. Additionally, Interloop is enhancing its water recycling capabilities to handle 60% capacity and has made significant investments in solar energy, with the development of a Solar Park that has increased its solar capacity to 12.6MW. Interloop is charting a sustainable path forward, with a strategic vision that touches all areas of its business. The company’s commitment to reducing its carbon footprint is evident in its strategic sourcing of sustainable materials and its ambitious renewable energy targets, including the goal to increase its capacity to 25MW by 2025. Central to Interloop’s long-term ESG strategy is the exploration of carbon markets and the expansion of its LEED footprint, which not only demonstrates its dedication to green infrastructure but also influences industry standards. Operational efficiency is key to Interloop’s sustainability agenda. By transitioning to low-emission fuels and streamlining processes, the company is minimising its environmental impact. Interloop is also actively mapping its supply chain and collaborating with partners to develop a comprehensive emissions reduction roadmap that encompasses both direct and indirect emissions. Through these strategic initiatives, Interloop is not only enhancing its sustainability profile, but is also driving industry-wide adoption of greener practices, proving that responsible business operations can coexist with commercial success. “We’re leading with a data-driven strategy, as Pakistan’s first large-scale company with Science Based Targets Initiative (SBTi)-approved emission reduction targets, cutting over 29k tonnes of emissions in FY2023. Our aim is a 51% cut in scope 1 and 2 emissions by 2032.” – Navid Fazil, CEO, Interloop Limited Interloop, a leading player in the hosiery industry and a major global supplier, has evolved into a diversified manufacturing powerhouse, expanding its horizons and innovating across various fronts in line with its Vision 2025. Now offering a wide range of clothing products, including denim, knitted apparel, and seamless activewear, Interloop serves top brands and retailers worldwide. With a substantial global presence spanning the US, Netherlands, and Japan, Interloop’s operational footprint extends across key manufacturing hubs in Pakistan, Sri Lanka, and China. In a recent strategic move, the company acquired a 64% stake in Top Circle Hosiery Mills, a US-based sock manufacturer, to strengthen its position in the global market.  In Pakistan, Interloop operates five hosiery plants, with two certified as LEED gold, in addition to a LEED platinum denim plant, an activewear plant, and now two apparel plants. Interloop Limited1 – KM, Khurrianwala-Jaranwala RoadKhurrianwala, Faisalabad, PakistanPhone: +92-41-4360400E-mail: sales@interloop.com.pk Noor Jehan SadiqHead of Marketing CommunicationsE-mail: njsadiq@interloop.com.pk Links Website: https://interloop-pk.com \n                The gold standard of business intelligence.\n             \n\n                    Find out more\n                    \n\n\n\n \n\t\tApparel sourcing and textile industry news & analysis \n\t\t\t\tPowered by\n\t\t\t\t\n © Verdict Media Limited 2025"
  },
  {
    "supplier": "Interloop Limited",
    "title": "An interview with Musadaq Zulqarnain, chairman Interloop Limited",
    "link": "https://www.brecorder.com/news/40295319",
    "published": "2024-03-25T07:00:00.000Z",
    "text": "Musadaq Zulqarnain is among the co-founders of Interloop Limited, Pakistan’s largest listed textile company by market capitalization. A business leader par excellence, Musadaq is credited for turning Interloop Limited into a $400 million export company, and the country’s second-largest exporter. Musadaq is a member Board of Directors of the Paksitan Textile Council, and has served on the Board of Faisalabad Industrial Estate Development & Management Company (FIEDMC), also serving as its CEO. He was also a Member of the Board of Port Qasim Authority. He is the President of Interloop Welfare Trust, engaged in numerous philanthropic activities in the country. He is also associated with The Citizens Foundation (TCF), the largest not-for-profit organization providing primary and secondary education in Pakistan. Musadaq began his professional career in the gas transmission industry (SNGPL), going on to become a successful entrepreneur. Over the last three decades, Musadaq has turned Interloop into one of the largest hosiery manufacturing and export businesses out of Asia, becoming a trusted partner of global brands such as Nike, Puma, Adidas, Target, H&M, Tesco, Reebok, Hugo Boss, Levi’s, among others. In his candid discussion with BR Research, Musadaq drops many truth bombs. While most textile seths are quick to point fingers towards Islamabad, he appears keen on introspection, using the Interloop’s success story as an example of what his competitors could do differently in an admittedly challenging economic environment. He appeared particularly concerned about the global headwinds and future trends, especially those pertaining to the textile industry’s transition towards Net Zero emissions, and the lack of preparedness of domestic value chain in this respect. He also showed anxiousness regarding the weaning of global textile value chain away from China, and whether Pakistan’s industry is ready to capture the market share up for grabs. The conversation carries many lessons for both the industry as well as policymakers. Below are the edited excerpts: BR Research (BRR): You are a first-generation industrialist, unlike many other top textile houses in the country. How did a new entrant manage to become the top player in an industry otherwise dominated by legacy families? Musadaq Zulqarnain (MZ): In Pakistan, scale in any business is synonymous with legacy names and sponsor relationships, rather than competitiveness or management quality. New entrants can only buck this trend by building a brand that is rooted in trust, reliability, and credibility. Back when we first started, commercial banks refused to issue our import LCs even against a hundred percent cash margin. However, in a few years as our business scaled and the company became known for its transparent management practices, banks began to chase after us, offering lines of credit. Similarly, when we decided to approach the equity markets, many bankers pleaded with us to keep the capital structure debt-financed, insisting that they shall cater to any future financing needs. We opted for public listing not because we had any unmet financing needs, but because we understood that our corporate governance will become even more efficient and stringent after going public due to increased scrutiny. BRR: Textiles is generally considered a low ROE industry, with an over-indexed share in bank lending. Would you advise privately held firms who traditionally rely on bank financing – especially the established players – to follow your path in going public? MZ: From a capital structure perspective, equity markets are best suited for companies in the growth phase. Sponsors can maximize their shareholding value by taking companies public, so long as they are able to gain investor confidence viz. management practices, transparency in corporate governance, and business outlook. If I could do it all over again, I would choose to take the company public over accumulating debt from banks. If the sponsors’ intent is to fleece the investors, they would inevitably lose the market’s confidence in the long term – whether it is shareholders or banks. BRR: In your view, why do legacy textile firms avoid going public? MZ: Unfortunately, the practice of keeping two sets of books is rampant in the domestic industry. Revenue and profit suppression both take place to underreport tax liability. Because exports operate under a fixed tax regime, the practice is slightly less common in export-oriented units. Businesses that sell only domestically are particularly infected by this scrouge. This is partly due to the perception that the manufacturing sector is over-taxed, but also because many non-core liabilities, such as worker participation funds and similar contributions, are linked to accounting performance. In my view, businesses that engage in this practice engage in self-harm. When reported accounts do not represent the true size and profitability of the business, firms struggle to secure financing because the accounts cast suspicion on the firm’s capacity to repay. Similarly, when balance sheet size or operating performance is underreported, firms may lose out to competitors in securing large orders, especially from foreign buyers. BRR: From a purely wealth maximization perspective, are sponsors who amass personal wealth by keeping two sets of books in business better off? MZ: If you examine the market value of Interloop, you will find that as a major shareholder, my personal wealth has multiplied faster by maintaining transparency in the accounts, than of competitors in similar lines of business who may have maintained two sets of books over time. BRR: Do you believe Pakistan’s indigenization approach to the development of textiles became an impediment to the growth of value-added segments? MZ: Globally, textiles and apparel are classified as separate industries. Historically, Pakistan had a comparative advantage in cotton-based fabrics, from the latest technology in weaving and spinning to the strong presence of an integrated value chain going all the way up to cotton farms. Before WTO, Pakistani textiles enjoyed preferential access to Western markets under the quota regime. As a result, to this day Pakistan has an abundance of skilled talent in spinning and weaving trained at various local textile institutes. However, the readymade garments and apparel industry suffered from lack of focus, as both the industry and policymakers failed to adapt with the changing trends in the global markets. When the quota system was eliminated from the international textile and apparel trade in 2005, Least Developed Countries (LDCs) such as Bangladesh positioned themselves as the low-cost manufacturing hubs for the rest of the world. The apparel industry in countries such as Bangladesh and Vietnam took full advantage of their low-cost labor. Initially, they fully focused their attention on labor-intensive segments such as readymade garments, while importing intermediate products such as yarn and fabric, which would have been more capital and energy-intensive to produce domestically. Meanwhile, Pakistan struggled to leverage its well-placed upstream yarn and fabric value chain, failing to position itself in the higher-value add industries of garments and apparel. This was partly because, until 1995, Pakistan had an export tax on raw cotton, which meant that the spinning and weaving industries enjoyed an abundant supply of low-cost raw material, usually procured at a steep discount to international market prices. Because cotton milling is largely commoditized and low in complexity, it enabled players with financial muscle to multiply in size. Thus, penetration in the export market became largely a function of volume and price. This was in sharp contrast to garments and apparel, which demand entrepreneurial attention, especially in product development and marketing. BRR: From an industrial policy perspective, what did Bangladesh get right over the last two decades? MZ: Several factors became instrumental in the divergent paths followed by Bangladesh and Pakistan over the last two decades. First, Bangladesh fully exploited its LDC status, seeking preferential market access – from Canada and USA to Europe. Equally significant was the urgency with which Bangladesh sought Free Trade Agreements with many economies in emerging markets, especially China. It allowed duty free import of yarn and greige fabric, allowing its garment industry access to raw material and intermediate inputs, rather than attempting to indigenize the whole supply chain. Third, Bangladesh exploited its low-cost labor potential to its fullest by actively encouraging female labor force participation, especially in the garments industry. Fourth, Bangladesh primed itself as the outsourcing hub for top global apparel brands by actively seeking business tourism. This was around the same time when Pakistan became a tourism pariah due to rise in religious extremism and terrorist incidents and violence, which effectively put a stop to foreigners – especially from Western nations – travelling to Karachi or Lahore. Fifth, Bangladesh enjoys friendly trade relations with regional countries, especially India, allowing it access to world’s second-largest yarn manufacturer at its doorstep. Lastly, it maintained a razor-sharp focus by specializing in garments and apparel segments only, which was rooted in its comparative advantage as a country: low-cost labor. Only now is the Bangladesh’s garments industry attempting to backward integrate because of a push to wean global value chains away from China. BRR: If the apparel industry in Bangladesh was dependent upon imported raw materials, why did Pakistan concurrently fail to multiply its export volume of yarn and fabric? MZ: Initially, when global retail rushed to factories in Bangladesh and Viet Nam attracted by their low wages, they also helped garment clusters in Bangladesh and Viet Nam source raw material – fiber and fabric – by nominating legacy suppliers in China India, and Pakistan. Later, when the industry in Bangladesh and Vietnam scaled up, they were very agile and quick to backward integrate – causing a decline in demand for yarn and fabric supplies from places such as Pakistan. Meanwhile, Pakistan’s industry was very slow to forward integrate, eventually losing out its share in low-value yarn and greige cloth trade as well. BRR: Was the failure to develop textile clusters a contributing factor to export slowdown? MZ: Firms in industrial clusters win collectively, but also lose together. Although Pakistan has industrial clusters just like any other textile manufacturing countries, the spirit of succeeding through cooperation is missing. When orders exceed our capacity or the lead time is short, it is very difficult to find trustworthy outsourcing partners. Often competitors go behind our backs to the buyer to price us out. Even when we find partners, ensuring quality control is cumbersome. BRR: Is the cotton-centric approach a comparative advantage for Pakistan’s textile industry or the root cause of its premature stagnation? MZ: Cotton was our strength, but that’s now history. Between 1970 and 2010, share of man-made fibers in global textiles rose from 40 percent to 72 percent. Pakistan, on the other hand, completely failed to develop its domestic synthetic fiber industry. The quality of polyester manufactured in Pakistan is hopeless, yet for a long time, the industry has faced curbs on import in the form of very high tariffs and duties at the import stage, which were imposed to protect two domestic polyester manufacturers. BRR: Aren’t fabrics and garments made of synthetic fibers perceived to be of inferior quality by consumers? MZ: Socks manufactured by Interloop use up to 40 percent man-made fibers, because the buyers are very receptive, especially to products made of blended material. There was a time when polyester fibers were considered inferior in quality and used to cause skin irritability. However, over the years, technology and innovation have changed the game dramatically. New varieties are considered to increase breathability and preferred by buyers. BRR: “Made of hundred percent cotton” label once commanded a premium. Does this no longer hold true? MZ: Globally, the demographic change since millennials have inverted trends and preferences in apparel. Formal clothing – even in corporate offices – is now being replaced by activewear, pullovers, and outdoor wear. Cotton has a significantly higher share in formal wear, whether in the form of woven fabric or readymade garments. But as formal wear goes out of fashion, so does demand for fabrics made predominantly of cotton. BRR: Talking about trends, what is the single greatest challenge faced by Pakistan’s export industry? MZ: The most significant development holding back Pakistani apparel manufacturers today is lead time. In the past, fashion trends used to change every six months on average, roughly in line with the change of season. Today, as Gen Z has come to dominate fast fashion, trends change every month. This means that retailers place orders in much smaller quantities for market testing, and demand agility in lead time for subsequent large orders. This has two consequences. First, if you cannot meet short lead times, the buyers are no longer interested. Second, the supply chain could no longer be geographically spread out as in the past. This resulted in tremendous backward integration in Bangladesh and Viet Nam, which as I explained before has led to a substantial decline in demand for Pakistani origin yarn and fabric. BRR: In retrospect, do you believe the massive expansion in the low-value-adding spinning segment using SBP’s concessional finance – under the TERF scheme – was a good idea? MZ: TERF was a success to the extent it helped catalyze the modernization of Pakistan’s outdated spinning manufacturing base. Installation of energy-efficient plants will obviously help the spinning industry make productivity gains. However, as I explained above, export demand for yarn is witnessing a secular decline due to forward integration in export destinations. Meanwhile, a small share of concessional finance flowed towards the expansion of the apparel manufacturing base. Unless the apparel industry grows, demand for fiber from the now-modernized spinning units will not grow. BRR: Many economists believe that concessional financing has made Pakistan’s textile industry inefficient and rent-seeking over the years, becoming dependent on handouts. Do you agree? MZ: Working capital loans breed inefficiency, especially when advanced on fixed rate. However, the same cannot be said of long-term loans. When we talk about the missed opportunity in readymade garments, it is no longer true that the industry is labor-intensive or requires low investment. In the past, the value-added industry was able to achieve a fixed asset turnover of at least two times, which in recent years has dropped to one. Previously, land and building costs used to be insignificant as a percentage of capex. Over the years, speculative activity in the property market has made land cost alone a headache in setting up factories. Even more significantly, capital intensity in manufacturing has also risen massively. Various stages of stitching and garments manufacturing now require specialized, hi-tech, and sensitive electronic machinery, which are also very expensive. In addition, large-scale units that directly export to global retail brands also face prohibitive infrastructure costs. We are not only required to set up effluent treatment plants, develop sewerage, drainage infrastructure, but also pay for development of roads, gas and water transmission infrastructure, power generation, and backup power units on alternate fuels. In addition, global brands with ESG agenda also expect that their suppliers adopt net zero practices, which includes regular capex for energy efficiency improvements as well as solar-based generation. If we are to continue supplying global brands, these good-to-haves shall turn into must-haves very soon. If Pakistan’s industry is to remain competitive, there is a need for continuous access to finance for BMR, lest our manufacturing practices become outdated. Capex cannot take place when the borrowing rate is above twenty percent. BRR: The BMR and expansion in the textiles manufacturing base during Covid was marketed as a push to capture business moving out of China, especially in the context of the Xinjiang ban and trade war. Does Pakistan stand a chance against competitors such as Bangladesh? MZ: Forget Bangladesh, India is massively investing in expansion of knitwear capacity to capture global retail business moving out of China. Unless Pakistan’s businesses and policymakers show agility, Pakistan could soon see significant loss of export market share to India. In coming years, the ‘lost export opportunity to Bangladesh of 2010s’ would be dwarfed in comparison to “lost export opportunity in knitwear’ to India. BRR: Does this mean Pakistan’s textile industry is weary of resumption of trade with India? MZ: The opposite. Just like Bangladesh, Pakistan should allow its value-added industry to fiber and fabric of Indian origin, so they can compete in the global market with the upcoming Indian capacity in knitwear and other high value-added segments. BRR: Will this not put Pakistani players, including the composite units, at a significant disadvantage? MZ: This is not only a question of price competitiveness. India is the world’s second-largest producer of yarn, with a vast and modern manufacturing base in synthetic, man-made fibers. Pakistan’s industry simply does not have access to a vast variety of modern MMF-based fibers and fabrics because of the protection afforded to the dinosaurs in the MMF segment. If Pakistan is to meet the complex demands of modern consumer in export markets, access to raw materials is equally crucial. Comments are closed."
  },
  {
    "supplier": "Interloop Limited",
    "title": "Pakistan’s Interloop Limited completes equity stake in USA’s Top Circle Hosiery Mills",
    "link": "https://www.brecorder.com/news/40276179/pakistans-interloop-limited-completes-equity-stake-in-usas-top-circle-hosiery-mills",
    "published": "2023-12-01T08:00:00.000Z",
    "text": "Interloop Limited (ILP), one of Pakistan’s largest textile exporters, has completed the acquisition of Top Circle Hosiery Mills Co., Inc., USA. The textile giant shared the development in a notice to the Pakistan Stock Exchange (PSX) on Friday. “We are pleased to convey that Interloop Limited (ILP) has successfully completed the proposed acquisition of 64% equity stake in the target company i.e., Top Circle Hosiery Mills Co., Inc. (Top Circle), USA, which is incorporated under the laws of United States of America, where it is registered,” read the notice. In September, the Board of Directors of Interloop granted the company its  approval to acquire the US company, which offers knitting machines and finishing equipment. Top Circle has a hosiery manufacturing subsidiary in China as well. “The proposed acquisition has been made after the execution of definitive transaction agreement(s) and securing all applicable corporate and regulatory approvals,” ILP said on Friday. It said that with the completion of this acquisition, Top Circle will now operate as a subsidiary of ILP, with ILP owning 64% of Top Circle. “This strategic move represents a significant milestone in our ongoing efforts to enhance shareholders’ value and strengthen our position in the global market and ultimately contribute to the long-term sustainability of our company,” said ILP. Set up in 1992 in Faisalabad with 10 knitting machines. ILP, after a series of expansions, is a complete vertically integrated company with state-of-the-art spinning, yarn dyeing, knitting and finishing facilities. It is also one of the largest exporting firms in Pakistan and among the largest listed companies on PSX.  \n \n As per the company’s latest financial results, during the first quarter of FY24, ILP generated a gross profit of Rs12.75 billion from sales amounting to Rs38.5 billion. This marked a significant increase from the corresponding period (1QFY23), with a rise of 26% in gross profit and 26.4% in sales, where the company earned a gross profit of Rs10.12 billion from sales of Rs30.46 billion Comments are closed."
  },
  {
    "supplier": "Interloop Limited",
    "title": "VIS reaffirms entity ratings of Interloop Limited",
    "link": "https://mettisglobal.news/vis-reaffirms-entity-ratings-of-interloop-limited/",
    "published": "2023-05-17T07:00:00.000Z",
    "text": "Our Solutions provide accurate, reliable financial data and cutting-edge analytical tools to help you harness the complexities of financial markets. Our purpose is to augment the efficiency of Pakistan’s financial markets by expanding accessibility to data, Realtime news and analytical tools to all, with technologically innovative and cost-effective solution. Our passionate team work diligently to continuously improve our solutions. Data or tech support on MG Link. Connect with us via Editorial Support\nLooking to connect with our Editorial support please send us Our Solutions provide accurate, reliable financial data and cutting-edge analytical tools to help you harness the complexities of financial markets. Our purpose is to augment the efficiency of Pakistan’s financial markets by expanding accessibility to data, Realtime news and analytical tools to all, with technologically innovative and cost-effective solution. Our passionate team work diligently to continuously improve our solutions. Data or tech support on MG Link. Connect with us via Editorial Support\nLooking to connect with our Editorial support please send us Our Solutions provide accurate, reliable financial data and cutting-edge analytical tools to help you harness the complexities of financial markets. Our purpose is to augment the efficiency of Pakistan’s financial markets by expanding accessibility to data, Realtime news and analytical tools to all, with technologically innovative and cost-effective solution. Our passionate team work diligently to continuously improve our solutions. Data or tech support on MG Link. Connect with us via Editorial Support\nLooking to connect with our Editorial support please send us May 17, 2023 (MLN): VIS Credit Rating Company Ltd. (VIS) has reaffirmed the entity ratings of Interloop Limited (ILP) at ‘A+/A-1’ (Single A plus/Single A-One), the company filing on the Pakistan stock exchange (PSX) showed today. The outlook on the assigned ratings is ‘Stable’. A long-term rating of ‘A+’ signifies good credit quality; protection factors are adequate. Risk factors may vary with possible changes in the economy. A short Term Rating of ‘A-1’ indicates high certainty of timely payment. Liquidity factors are excellent and supported by good fundamental protection factors. Risk factors are minor. The previous rating action was announced on June 03, 2022. The ratings reflect ILP’s dominant market position as a leading textile exporter, particularly in hosiery, as well as its presence in apparel, seamless activewear, and yarn sales. In FY22, ILP ranked third amongst the top ten exporters in the country and has been recognized by numerous reputable organizations and publications as a major global supplier of socks. Additionally, ratings consider the extensive operating history of nearly three decades, vertically-integrated structure, renowned global brands and retailers as major customers, global marketing presence, and commitment to environmentally friendly and sustainable manufacturing practices. Ratings reaffirmation reflects robust topline growth along with an uptrend in profitability margins leading to build-up of strong capitalization buffers and improved cash flow coverage over the past two fiscal years. However, owing to higher debt utilization for expansion, leverage indicators have remained on the higher side vis-à-vis similarly rated peers. The business risk profile takes into account industry-wide growth in exports over the last year, however, recent floods across the country, high interest rate situation, inflationary pressures, higher electricity costs, and demand slowdown pose risks to the sector over the medium term. Ratings are constrained by the current weak macroeconomic environment globally and locally. More than 90% of the revenue comes from export sales, while local sales contribute the remainder. Segment-wise, hosiery exports generate about three-quarters of revenue, and the remaining is shared by spinning, denim, apparels and others. Local sales mainly comprise of yarn and wastage. Product-wise, the majority of revenue is generated from the sale of socks, followed by denim trousers, yarn, dyed yarn, garments, boxers, and active wear. Geographic sales mix depicts concentration as nearly half of the exports are directed towards the U.S., with the remaining spread out across diverse regions such as Germany, Netherland, Ireland, Sweden, and others. Client concentration risk is elevated, with top 10 clients consistently generating more than two-thirds of the total sales on a timeline, albeit long-standing relationships with respected international brands and high customer satisfaction underpinned by a focus on quality providing sustainability and comfort. ILP has recently completed expansion in hosiery division, and is currently in the process of establishing a new fully integrated garment manufacturing complex (ILP Apparel Park) in Faisalabad. Following this expansion, the apparel division is expected to become the second-largest segment of the company. Furthermore, ILP has plans to expand the capacity of all its divisions in the future. Copyright Mettis Link News Posted on: 2023-05-17T14:08:18+05:00 Data is delayed by 20 minutes Data is delayed by 20 minutes To see more commodities please register for our portal                 © 2024 Mettis Link News All rights reserved​"
  },
  {
    "supplier": "Interloop Limited",
    "title": "Interloop Limited posts 63% YoY profit growth in FY23, announces 20% cash dividend",
    "link": "https://mettisglobal.news/interloop-limited-posts-63-yoy-profit-growth-in-fy23-announces-20-cash-dividend/",
    "published": "2023-09-07T07:00:00.000Z",
    "text": "Our Solutions provide accurate, reliable financial data and cutting-edge analytical tools to help you harness the complexities of financial markets. Our purpose is to augment the efficiency of Pakistan’s financial markets by expanding accessibility to data, Realtime news and analytical tools to all, with technologically innovative and cost-effective solution. Our passionate team work diligently to continuously improve our solutions. Data or tech support on MG Link. Connect with us via Editorial Support\nLooking to connect with our Editorial support please send us Our Solutions provide accurate, reliable financial data and cutting-edge analytical tools to help you harness the complexities of financial markets. Our purpose is to augment the efficiency of Pakistan’s financial markets by expanding accessibility to data, Realtime news and analytical tools to all, with technologically innovative and cost-effective solution. Our passionate team work diligently to continuously improve our solutions. Data or tech support on MG Link. Connect with us via Editorial Support\nLooking to connect with our Editorial support please send us Our Solutions provide accurate, reliable financial data and cutting-edge analytical tools to help you harness the complexities of financial markets. Our purpose is to augment the efficiency of Pakistan’s financial markets by expanding accessibility to data, Realtime news and analytical tools to all, with technologically innovative and cost-effective solution. Our passionate team work diligently to continuously improve our solutions. Data or tech support on MG Link. Connect with us via Editorial Support\nLooking to connect with our Editorial support please send us September 07, 2023 (MLN):  Interloop Limited (PSX: ILP) experienced a notable 63.21% YoY increase in profitability in FY23, achieving a significant profit after tax of Rs20.17 billion [EPS: Rs14.39]. This growth contrasts with the Rs12.36bn profit [EPS: Rs8.82] recorded in the previous year. Along with the results, the company announced a final cash dividend at Rs2 per share i.e. 20% for the year ended June 30, 2023. This is in addition to the interim cash dividend already paid for the year ended June 30, 2023, at Rs3 per share i.e. 30%. Going by the results, the company's top line surged by 31.14% YoY to Rs119.2bn as compared to Rs90.89bn in SPLY. The cost of sales also increased by 22.37% YoY but was lesser than proportionate to sales rise, which improved the gross profit by 52.97% YoY to Rs39.87bn in FY23. Moreover, during the review period, other income surged by 2.77x YoY to stand at Rs158.24m in FY23 as compared to Rs57.12m in SPLY. On the expense side, the company observed a rise in distribution cost by 16.87% YoY and other expenses by 26.96% YoY to clock in at Rs3.95bn and Rs2.72bn respectively during the review period. The company’s finance costs soared by 2.22x YoY and stood at Rs5.53bn as compared to Rs2.49bn in FY23, mainly due to higher interest rates. On the tax front, the company paid a higher tax worth Rs1.41bn against the Rs1.06bn paid in the corresponding period of last year, depicting an increase of 32.71% YoY. Amount in thousand except for EPS Copyright Mettis Link News Posted on: 2023-09-07T14:39:30+05:00 Data is delayed by 20 minutes Data is delayed by 20 minutes To see more commodities please register for our portal                 © 2024 Mettis Link News All rights reserved​"
  },
  {
    "supplier": "Welspun Living Limited",
    "title": "Welspun Living Limited's (NSE:WELSPUNLIV) Stock Has Been Sliding But Fundamentals Look Strong: Is The Market Wrong?",
    "link": "https://simplywall.st/stocks/in/consumer-durables/nse-welspunliv/welspun-living-shares/news/welspun-living-limiteds-nsewelspunliv-stock-has-been-sliding",
    "published": "2024-11-18T08:00:00.000Z",
    "text": "Stock Analysis  It is hard to get excited after looking at Welspun Living's (NSE:WELSPUNLIV) recent performance, when its stock has declined 18% over the past three months.   However, stock prices are usually driven by a company’s financial performance over the long term, which in this case looks quite promising.     Particularly, we will be paying attention to Welspun Living's  ROE today.     Return on Equity or ROE is a test of how effectively a company is growing its value and managing investors’ money.  In simpler terms, it measures the profitability of a company in relation to shareholder's equity.   View our latest analysis for Welspun Living   The formula for ROE is:   Return on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity  So, based on the above formula, the ROE for Welspun Living is: 15% = ₹7.0b ÷ ₹47b (Based on the trailing twelve months to September 2024).  The 'return' is the income the business earned over the last year.  One way to conceptualize this is that for each ₹1 of shareholders' capital it has, the company made ₹0.15 in profit.   Thus far, we have learned that ROE measures how efficiently a company is generating its profits.  Based on how much of its profits the company chooses to reinvest or \"retain\", we are then able to evaluate a company's future ability to generate profits.  Generally speaking, other things being equal, firms with a high return on equity and profit retention, have a higher growth rate than firms that don’t share these attributes.   To start with, Welspun Living's ROE looks acceptable.   Further, the company's ROE compares quite favorably to the industry average of 8.2%.   This certainly adds some context to Welspun Living's decent 6.4% net income growth seen over the past five years.      As a next step, we compared Welspun Living's net income growth with the industry and were disappointed to see that the company's growth is lower than the industry average growth of 21% in the same period.     Earnings growth is a huge factor in stock valuation.  What investors need to determine next is if the expected earnings growth, or the lack of it, is already built into the share price.  Doing so will help them establish if the stock's future looks promising or ominous.    One good indicator of expected earnings growth is the P/E ratio which determines the price the market is willing to pay for a stock based on its earnings prospects. So, you may want to check if Welspun Living is trading on a high P/E or a low P/E, relative to its industry.     Welspun Living's three-year median payout ratio to shareholders is 1.4% (implying that it retains 99% of its income), which is on the lower side, so it seems like the management is reinvesting profits heavily to grow its business.     Additionally, Welspun Living has paid dividends over a period of at least ten years which means that the company is pretty serious about sharing its profits with shareholders.      Our latest analyst data shows that the future payout ratio of the company is expected to rise to 9.1% over the next three years.   Regardless, the ROE is not expected to change much for the company despite the higher expected payout ratio.      In total, we are pretty happy with Welspun Living's performance.      Specifically, we like that the company is reinvesting a huge chunk of its profits at a high rate of return. This of course has caused the company to see a good amount of growth in its earnings.       Having said that, looking at the current analyst estimates, we found that the company's earnings are expected to gain momentum.     To know more about the latest analysts predictions for the company, check out this visualization of analyst forecasts for the company.  Discover if Welspun Living might be undervalued or overvalued with our detailed analysis, featuring fair value estimates, potential risks, dividends, insider trades, and its financial condition. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Engages in the manufacture and sale of home textile products in India and internationally. Good value with reasonable growth potential. Financial Data provided by S&P Global Market Intelligence LLC, analysis provided by Simply Wall Street Pty Ltd. Copyright © 2025, S&P Global Market Intelligence LLC. All rights reserved. Markets Investing Ideas Features Simply Wall St Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. © 2025 Simply Wall Street Pty Ltd, US Design Patent #29/544/281, Community and European Design Registration #2845206"
  },
  {
    "supplier": "Welspun Living Limited",
    "title": "Welspun Living Limited: Making Strides Towards Greener Future",
    "link": "https://www.outlookbusiness.com/news/welspun-living-limited-making-strides-towards-greener-future-news-417719",
    "published": "2024-05-11T07:00:00.000Z",
    "text": "Get magazine delivered to your doorstep Get latest issue delivered instantly Only in Delhi-NCR, Mumbai, Bengaluru & Pune Get magazine delivered to your doorstep Get latest issue delivered instantly Only in Delhi-NCR, Mumbai, Bengaluru & Pune News  Cognisant of the adverse impact of climate change occurring worldwide, Welspun Living Limited (WLL) has been striving to advance systematically on the path of sustainable development. As part of this endeavour, WLL, a global leader in home solutions, has chosen to adopt a holistic Environmental, Social, and Governance (ESG) approach with an aim to propel well-being of all their stakeholders at each stage of their operations.  On the road to achieve this goal, WLL has been actively collaborating and engaging with numerous national and international agencies, aligning with guidelines such as the Paris Agreement, which aims to limit global temperature rise to below 2°C, and the United Nations Sustainable Development Goals (UN SDGs) for 2030. The company also adheres to the National Action Plan on Climate Change (NAPCC) and has integrated its guidelines in its overarching climate change mitigation strategy. One of its primary focus areas is to increase the share of green energy in its overall consumption mix. This has led the company to establish a 30 MW solar power plant at its Anjar facility. It has also entered into a long term PPA with a RE developer for supplying RE power for its Vapi facility. “We are advancing towards attaining 100 percent of our total energy consumption from renewable sources by 2030. In 2021-22, we forged strategic partnerships with two reputable renewable energy developers, propelling us closer to our clean energy goals, and ensuring a steady supply of green power to our operations in Anjar and Vapi,” the company proudly states.  WLL has also been striving to conserve every drop of freshwater to make it accessible to communities struggling with water scarcity. At the Anjar facility, the company has implemented a sewage treatment plant (STP) that not only eliminates the need for freshwater intake in the manufacturing operations, but also collects sewage from nearby municipalities for responsible treatment, reuse, and discharge. This initiative serves multiple purposes within the climate strategy. The company’s pursuit of circularity (SPUN) has birthed ground breaking solutions that transform waste materials into invaluable products. Resource efficiency and waste reduction are guiding principles, helping the company achieve zero waste to landfill while fostering sustainable innovation.  In keeping with its commitment is to enhance consumer well-being and create a more intelligent and sustainable world, WLL prioritises the use of sustainable fibers - BCI (Better Cotton Initiative) certified cotton, Organic, Recycled, beside producing organic cotton (non-GMO) through its sustainable farming projects. Committed to sourcing cotton exclusively from sustainable sources, the company’s dedicated initiative, “Wel-Krishi,” aims to educate the farmers on how to grow better produce, with the goal of achieving 100 percent sustainable raw material usage by 2030. The company has embarked on a roadmap to transform the textile industry with Wel-Trak 2.0, an upgrade to Wel-Trak®, the company’s patented end-to-end traceability technology introduced in 2018. The upgraded platform is designed to help the stakeholders – from retailers to farmers and manufacturers to suppliers, traders, certifying bodies, and end consumers – to track raw materials throughout the supply chain back to its origin.  “We aim to establish WLL as a pioneer in sustainable textiles. Guided by our ESG-centric approach and in alignment with the UN SDGs, WLL strives to implement optimal business practices across operations, mitigate risks while identifying potential opportunities, and safeguards stakeholder interests effectively,” the company states.  With a dedicated Board of Directors and an ESG and CSR committee of the board, the company ensures effective delegation and design of sustainability related measures. The management or committee is responsible for implementing climate initiatives and accountable for strategy development and execution. Having set comprehensive emissions targets covering Scope 1, Scope 2 emissions, WLL’s targets are built on a well-defined baseline year FY2020, reflecting a specific percentage reduction in base year emissions.  WLL sustainability goals are:  Conducting life cycle analysis (LCA) for its products, enabling it to identify opportunities to minimise environmental impact across the entire value chain. The company has already made significant strides in using sustainable raw materials such as organic, BCI (Better Cotton Initiative) certified cotton, and recycled cotton, ensuring the responsible sourcing of inputs. To conserve water resources, it has adopted the practice of utilising recycled sewage water for manufacturing processes.  The commitment to ethical production is exemplified by the adherence to internationally recognised standards. Textile goods bearing the GOTS (Global Organic Textile Standard) and OEKO-TEX® Standard 100 certifications guarantee that they have been produced ethically. The company has been continuously striving to improve its processes and treatment systems to meet the stringent requirements of the Zero Discharge of Hazardous Chemicals (ZDHC) standard, ensuring the responsible management of chemicals.  On the social front, WLL has launched various initiatives under its Corporate Social Values (CSV) programme focusing on improving the health and prosperity of our community, particularly children, women, and senior citizens. The impetus is on nurturing business relations that drive inclusive growth, women empowerment, safe & healthy workspaces and supporting community livelihood generation. The company is proud of the difference it is making in the society ,including the fact that 27 percent of its workforce are women. The idea of sustainability is embedded in every sphere of WLL’s operations. Signalling its commitment to women empowerment, WLL has established 8 SPUN centres across Kutch, with more than 2200 trained women, so far impacting lives of 8860 people across the region. Impact of WLL’s Sustainability programme has been such that an Ivey case study on WLL’s transformation is part of the curriculum of several universities across the US, Canada, France, Europe, and Taiwan.  The result of all these efforts is evident as in 2023 the company achieved a notable score of 66/100 in S&P Global ESG score (DJSI Corporate Sustainability Assessment (CSA) for 2023. The score is highest for any company from India in the Textile, Apparel & Luxury goods category. The company is also ranked 7th in the Global rankings in the S&P Global ESG ratings. The company also achieved a score of 11.3 on Sustainalytics’ ESG risk ratings, a significant improvement over its previous year score of 14.4. Sustainalytics, a leading independent ESG and corporate governance research, ratings, and analytics firm which evaluates companies across various industry sectors, assessed WIL’s performance in the Textile & Apparel category. Welspun India now ranks 9th out of 202 participants worldwide and is positioned in the “Low risk” category. It is the highest ranked Indian company amongst industry peers and thus it is an acknowledgment of WLL’s consistent push to adopt ESG as an important pillar of its business strategy.  Dipali Goenka, MD & CEO, Welspun Living Ltd said, “Our company’s initiatives towards the environment have only been growing with the company’s strengthening position both domestically & globally. We have also endeavoured to give back to the society and such achievements motivate the team even further to go the extra mile and think out-of-the-box for to conserve our environment.” Watch | What It’s Like Living Next to Delhi’s Ghazipur Landfill WATCH | Don't Fear the Dip: Himanshu Kohli’s Take on Market Volatility | Bulls & Bazaar WATCH |Helen Clarkson Decodes Trump's Effect On Increasing Climate Vulnerability |Planet People Profit Watch | Heinz Victory Over Forgery Union Budget 2025: FM Sitharaman Announces No Income Tax Payable Up To Income of Rs 12 Lakh Union Budget 2025: Celebrating India's Economic Tradition With Halwa Ceremony| See Photos Copyright © 2025 Outlook Publishing India Pvt Ltd. Copyright © 2025 Outlook Publishing India Pvt Ltd. All pages of the Website are subject to our terms and conditions and privacy policy. You must not reproduce, duplicate, copy, sell, resell or exploit any material on the Website for any commercial purposes."
  },
  {
    "supplier": "Welspun Living Limited",
    "title": "Welspun Living Limited's CEO & MD, Dipali Goenka, Honored with CNBC's Changemaker Award",
    "link": "https://infashionbusiness.com/home/news_details/2557/9",
    "published": "2024-03-01T08:00:00.000Z",
    "text": "AWARD\nNATIONAL\n \nMUMBAI, MAHARASHTRA, INDIA \n \nBy IFAB MEDIA - NEWS BUREAU -\nMarch 1, 2024 |      141\n2 minutes read\n Welspun Living Limited is proud to announce that Dipali Goenka, CEO & MD of Welspun Living Limited, has been recognized with a globally coveted accolade in the inaugural CNBC Changemakers. This prestigious award celebrates women leaders who have demonstrated exceptional success in their fields, showcasing innovative approaches to longstanding business challenges and seizing new market opportunities.   Under Dipali Goenka's visionary leadership, Welspun has not only scaled new heights in the textile industry but has also been at the forefront of advocating for women's leadership and empowerment. Her strategic insights and relentless pursuit of excellence have paved the way for Welspun's significant contributions to the economy and the business world.   The CNBC Changemakers list for 2024 highlights a diverse group of women who have defied the odds, driven innovation, and thrived in a volatile business landscape. From trailblazing startup founders to impactful C-suite executives, these changemakers have broken new ground and charted a path for future leaders. The CNBC Changemakers global award brings to light the accomplishments of both well-known and unsung women leaders, emphasizing their significant impact on the economy and business.   On receiving the award, Dipali Goenka, CEO & MD of Welspun Living, expressed her gratitude and shared her vision: \"This recognition is not just a personal milestone but a testament to the collective effort of every woman who strives to make a difference in the business world. At Welspun, we believe in empowering women to reach their full potential, and this award reinforces our commitment to creating a more inclusive and equitable industry. Together, we can continue to break barriers and inspire change for sustainable, inclusive, and equitable gender parity.\" Choose  We use cookies and similar technologies to recognize your repeat visits and preferences, as well as to measure and analyze traffic. To learn more about cookies, including how to disable them, view our Cookie Policy. By clicking \"I Accept\" on this banner, you consent to the use of cookies unless you disable them."
  },
  {
    "supplier": "Arvind Limited",
    "title": "The Price Is Right For Arvind Limited (NSE:ARVIND)",
    "link": "https://simplywall.st/stocks/in/consumer-durables/nse-arvind/arvind-shares/news/the-price-is-right-for-arvind-limited-nsearvind",
    "published": "2024-11-26T08:00:00.000Z",
    "text": "Stock Analysis  When close to half the companies in India have price-to-earnings ratios (or \"P/E's\") below 31x, you may consider Arvind Limited (NSE:ARVIND) as a stock to potentially avoid with its 34.2x P/E ratio.  However, the P/E might be high for a reason and it requires further investigation to determine if it's justified.     Arvind hasn't been tracking well recently as its declining earnings compare poorly to other companies, which have seen some growth on average.   It might be that many expect the dour earnings performance to recover substantially, which has kept the P/E from collapsing.  You'd really hope so, otherwise you're paying a pretty hefty price for no particular reason.      View our latest analysis for Arvind   The only time you'd be truly comfortable seeing a P/E as high as Arvind's is when the company's growth is on track to outshine the market.    If we review the last year of earnings, dishearteningly the company's profits fell to the tune of 10%.   Even so, admirably EPS has lifted 105% in aggregate from three years ago, notwithstanding the last 12 months.  Although it's been a bumpy ride, it's still fair to say the earnings growth recently has been more than adequate for the company.     Turning to the outlook, the next three years should generate growth of 44%  per annum as estimated by the five analysts watching the company.  Meanwhile, the rest of the market is forecast to only expand by 19% per annum, which is noticeably less attractive.   In light of this, it's understandable that Arvind's P/E sits above the majority of other companies.  Apparently shareholders aren't keen to offload something that is potentially eyeing a more prosperous future.    Using the price-to-earnings ratio alone to determine if you should sell your stock isn't sensible, however it can be a practical guide to the company's future prospects.   We've established that Arvind maintains its high P/E on the strength of its forecast growth being higher than the wider market, as expected.  Right now shareholders are comfortable with the P/E as they are quite confident future earnings aren't under threat.  It's hard to see the share price falling strongly in the near future under these circumstances.       Plus, you should also learn about this   1 warning sign we've spotted with Arvind.   You might be able to find a better investment than Arvind. If you want a selection of possible candidates, check out this free list of interesting companies that trade on a low P/E (but have proven they can grow earnings).  We've created the ultimate portfolio companion for stock investors, and it's free. • Connect an unlimited number of Portfolios and see your total in one currency• Be alerted to new Warning Signs or Risks via email or mobile• Track the Fair Value of your stocks Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Manufactures, markets, retails, supplies, and exports textiles in India and internationally. Flawless balance sheet with reasonable growth potential and pays a dividend. Financial Data provided by S&P Global Market Intelligence LLC, analysis provided by Simply Wall Street Pty Ltd. Copyright © 2025, S&P Global Market Intelligence LLC. All rights reserved. Markets Investing Ideas Features Simply Wall St Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. © 2025 Simply Wall Street Pty Ltd, US Design Patent #29/544/281, Community and European Design Registration #2845206"
  },
  {
    "supplier": "Arvind Limited",
    "title": "Institutions along with private companies who hold considerable shares inArvind Limited (NSE:ARVIND) come under pressure; lose 5.7% of holdings value",
    "link": "https://simplywall.st/stocks/in/consumer-durables/nse-arvind/arvind-shares/news/institutions-along-with-private-companies-who-hold-considera-70",
    "published": "2024-11-13T08:00:00.000Z",
    "text": "Stock Analysis  Every investor in Arvind Limited (NSE:ARVIND) should be aware of the most powerful shareholder groups.  We can see that private companies own the lion's share in the company with 38% ownership.  Put another way, the group faces the maximum upside potential (or downside risk).   While institutions who own 29% came under pressure after market cap dropped to ₹91b last week,private companies took the most losses.       Let's delve deeper into each type of owner of Arvind, beginning with the chart below.   View our latest analysis for Arvind   Institutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.   As you can see, institutional investors have a fair amount of stake in Arvind.  This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does.  If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at Arvind's earnings history below. Of course, the future is what really matters.   We note that hedge funds don't have a meaningful investment in Arvind.      Mayur Prakash Trading and Commercial Private Limited is currently the company's largest shareholder with 34% of shares outstanding.        Meanwhile, the second and third largest shareholders, hold 5.8% and 4.3%, of the shares outstanding, respectively.     On further inspection, we found that more than half the company's shares are owned by the top 6 shareholders, suggesting that the interests of the larger shareholders are balanced out to an extent by the smaller ones.    While studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance.   There are plenty of analysts covering the stock, so it might be worth seeing what they are forecasting, too.    The definition of company insiders can be subjective and does vary between jurisdictions. Our data reflects individual insiders, capturing board members at the very least.  Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO.   Insider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances.   Our most recent data indicates that insiders own less than 1% of Arvind Limited.   However, it's possible that insiders might have an indirect interest through a more complex structure.    Keep in mind that it's a big company, and the insiders own ₹309m worth of shares. The absolute value might be more important than the proportional share.  It is always good to see at least some insider ownership, but it might be worth checking if those insiders have been selling.    The general public, who are usually individual investors, hold a 29% stake in Arvind.   This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.   We can see that Private Companies own 38%, of the shares on issue.  Private companies may be related parties. Sometimes insiders have an interest in a public company through a holding in a private company, rather than in their own capacity as an individual. While it's hard to draw any broad stroke conclusions, it is worth noting as an area for further research.    It's always worth thinking about the different groups who own shares in a company. But to understand Arvind better, we need to consider many other factors.    Be aware that  Arvind is showing  1 warning sign in our investment analysis , you should know about...      Ultimately the future is most important. You can access this free report on analyst forecasts for the company.  NB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures. We've created the ultimate portfolio companion for stock investors, and it's free. • Connect an unlimited number of Portfolios and see your total in one currency• Be alerted to new Warning Signs or Risks via email or mobile• Track the Fair Value of your stocks Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Manufactures, markets, retails, supplies, and exports textiles in India and internationally. Flawless balance sheet with reasonable growth potential and pays a dividend. Financial Data provided by S&P Global Market Intelligence LLC, analysis provided by Simply Wall Street Pty Ltd. Copyright © 2025, S&P Global Market Intelligence LLC. All rights reserved. Markets Investing Ideas Features Simply Wall St Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. © 2025 Simply Wall Street Pty Ltd, US Design Patent #29/544/281, Community and European Design Registration #2845206"
  },
  {
    "supplier": "Arvind Limited",
    "title": "Arvind Limited launches campaign with Dr. Lakshyaraj Singh Mewar as Primanté Luxury Fabrics ambassador",
    "link": "https://www.medianews4u.com/arvind-limited-launches-campaign-with-dr-lakshyaraj-singh-mewar-as-primante-luxury-fabrics-ambassador/",
    "published": "2024-09-02T07:00:00.000Z",
    "text": "Ahmedabad: Arvind Limited is excited to introduce their campaign with Dr. Lakshyaraj Singh Mewar of Udaipur as the brand ambassador for Primanté. The campaign “Own Your Legacy, Own The Moment” highlights Primanté’s elegant fabrics for the modern wardrobe. The Primanté Collection, a collaboration with Dr. Lakshyaraj Singh Mewar, embodies Arvind Limited’s dedication to quality and innovation, merging India’s regal history with modern fashion elegance. With extensive textile experience, Arvind Limited focuses on quality and sustainability, pushing fashion innovation. Primanté brand’s luxurious fabrics aim to set new standards in premium fashion worldwide. For more information about the campaign or to explore the new Primanté collection, please visit nearest Arvind Stores &muti-branded outlets. Hyderabad: CARE Hospitals, one of India’s leading multi-specialty healthcare providers, has announced the launch of its latest national campaign, “The... New Delhi: Pee Safe has launched its latest campaign, #Zero Period, in honor of Menstrual Hygiene Day. The campaign aims... MUMBAI: Canon India has unveiled its latest digital campaign India #CANwithCanon, shining a light on how technology is deeply embedded... MUMBAI: MOMS, an outdoor specialised unit of Madison World, delivered a campaign for Shaadi.com. The aim was to melt more... Mumbai: Motilal Oswal Financial Services (MOFS) new campaign employs humour to illustrate how the absence of proper expertise and support... Mumbai: C Com Digital a techno digital agency from India, delivered an impactful campaign for Religen Inc., a USA-based company,... Mumbai: The Indian Premier League (IPL) 2025 continues to be a magnet for advertisers, with over 100 brands leveraging the... Pune: Loop, the Insurance and Healthcare company on a mission to add 20 healthy years to the lives of working... Mumbai: Sting Energy®, PepsiCo’s electrifying energy drink, has officially entered the high-octane world of Formula 1® as its Official Energy... \n\n \n\n Mumbai: Zenith India has promoted Nisha Didwania to Senior Vice President, a move that underscores her pivotal role in driving... Lucknow: India today mourns the loss of one of its most steadfast voices in journalism, Dr. K. Vikram Rao, who passed... Let’s cut to the chase. AI is no longer that buzzword we discuss over agency chai breaks while wondering if... \n\n \n\n  Medianews4u.com © 2019 - 2024 All rights reserved.  Medianews4u.com © 2019 - 2024 All rights reserved."
  },
  {
    "supplier": "Arvind Limited",
    "title": "Arvind Limited to invest Rs 400 cr in Jharkhand mill",
    "link": "https://www.fibre2fashion.com/news/textile-news/arvind-limited-to-invest-rs-400-cr-in-jharkhand-mill-228722-newsdetails.htm?fromnewsdog=1&amp=true",
    "published": "2024-03-26T07:37:59.000Z",
    "text": "28 Oct 17  1 min read\r\n                            \r\n                         \nFibre2Fashion News Desk – India\n\n\n\n\r\n                        Disclaimer - All News/Articles items are subject to copyright and no article either in full or part may be reproduced in any form without permission from Fibre2Fashion Pvt. Ltd.\r\n                    \n\n Fibre2Fashion News Desk – India \n\nTextiles\n\n\r\n\r\n                                    Japan announces $15.5-bn package to protect SMEs from US tariffs\r\n                                \n\n\r\n\r\n                            27th May 2025\r\n\r\n                            1 min read\r\n\r\n                        \n \n\nTextiles\n\n\r\n\r\n                                    US, Turkiye conclude 3rd round of talks to discuss tariffs, trade ties\r\n                                \n\n\r\n\r\n                            27th May 2025\r\n\r\n                            1 min read\r\n\r\n                        \n \n\nTextiles\n\n\r\n\r\n                                    US tariffs not yet a disaster to worry about in Cambodia: TAFTAC\r\n                                \n\n\r\n\r\n                            27th May 2025\r\n\r\n                            2 min read\r\n\r\n                        \n \n\nTextiles\n\n\r\n\r\n                                    India’s loom QCO faces industry pushback ahead of deadline\r\n                                \n\n\r\n\r\n                            27th May 2025\r\n\r\n                            3 min read"
  },
  {
    "supplier": "Arvind Limited",
    "title": "Arvind Limited appoints Dr. Lakshyaraj Singh Mewar as brand ambassador for Primanté Luxury Fabrics",
    "link": "https://infashionbusiness.com/home/news_details/2754/8",
    "published": "2024-04-03T07:00:00.000Z",
    "text": "NEW BRAND AMBASSADOR\n  PRIMANTÉ\n FABRICS BRAND\n INNOVATIVE COLLECTION\n AUSTRALIAN MERINO WOOL\n EGYPTIAN COTTON\n SILK\n MOHAIR\nNATIONAL\n \nAHMEDABAD, GUJARAT, INDIA\n \nBy IFAB MEDIA - NEWS BUREAU -\nApril 3, 2024 |      265\n2 minutes read\n Arvind Limited proudly announces a strategic collaboration with His Highness, Dr Lakshyaraj Singh Mewar of Udaipur, as the brand ambassador for Primanté, its premium suiting & shirting brand, enhancing its global and domestic reach.   Maharaj Kumar Sahib Dr. Lakshyaraj Singh Ji Mewar of Udaipur is a versatile individual excelling in philanthropy, education, sports, business, TED talks, and various Guinness World Records. Dedicated to noble causes from youth, he tirelessly champions public service with passion and selflessness.   His Highness Dr Lakshyaraj Singh Mewar of Udaipur said, “I am honored to collaborate with Arvind as the brand ambassador for Primanté Luxury Fabrics. This partnership not only represents a union of heritage and innovation but also signifies our collective dedication to elevating the standards of luxury and sophistication in the realm of fashion. Together, we embark on a journey to inspire a lifestyle that embodies timeless elegance and refinement.”   Kulin Lalbhai, Executive Director, Arvind Ltd said, “We are pleased to welcome Dr Lakshyaraj Singh Mewar of Udaipur to the Primanté family. His association with our brand not only reinforces our commitment to excellence but also sets the stage for exciting collaborations and innovations in the luxury fashion space.”    Primanté offers sophisticated fabrics like Australian Merino wool and Egyptian Giza cotton in suiting and shirting. Their range includes Super 120s to Super 200s blends with Silk, Mohair, and more. The collection extends to tweed jackets, business coats, and shirting with high-quality standards. Find Primanté at “The Arvind Stores” and Multi-Brand Outlets. This collaboration elevates Primanté to the elite class of luxury fabrics, showcasing innovation and Italian-inspired designs that redefine sophistication. Choose  We use cookies and similar technologies to recognize your repeat visits and preferences, as well as to measure and analyze traffic. To learn more about cookies, including how to disable them, view our Cookie Policy. By clicking \"I Accept\" on this banner, you consent to the use of cookies unless you disable them."
  },
  {
    "supplier": "Arvind Limited",
    "title": "Arvind Limited Unveils Its First Campaign with His Highness Dr. Lakshyaraj Singh Mewar as Brand Ambassador for Primanté Luxury Fabrics",
    "link": "https://www.passionateinmarketing.com/arvind-limited-unveils-its-first-campaign-with-his-highness-dr-lakshyaraj-singh-mewar-as-brand-ambassador-for-primante-luxury-fabrics/",
    "published": "2024-09-02T07:00:00.000Z",
    "text": "Ahmedabad, September  02, 2024 — Arvind Limited, a leading integrated solutions provider in textiles with robust fiber-to-fashion capabilities, is thrilled to announce its first campaign featuring His Highness Dr. Lakshyaraj Singh Mewar of Udaipur as the brand ambassador for Primanté, the company’s premium suiting and shirting brand. The campaign, titled “Own Your Legacy, Own The Moment” celebrates the timeless elegance and sophistication that Primanté fabrics bring to the modern wardrobe. The Primanté Collection is a testament to Arvind Limited’s commitment to quality, innovation, and craftsmanship. By collaborating with Dr. Lakshyaraj Singh Mewar, a symbol of heritage and tradition, Arvind Limited aims to weave a narrative that connects the grandeur of India’s royal past with the contemporary elegance of today’s fashion. Arvind Limited, with its vast experience in textiles and an unwavering focus on quality and sustainability, continues to push the boundaries of innovation in fashion. The Primanté brand, with its luxurious fabric offerings, is set to redefine the standards of premium fashion in India and globally. For more information about the campaign or to explore the new Primanté collection, please visit nearest Arvind Stores & muti-branded outlets. About The Arvind Store: ‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month. About Arvind Limited: Arvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide. For more information, please visit https://www.arvind.com/ Log in to leave a comment Passionate in Marketing is promoted by i-miRa Knowledge Solutions, a company founded in 2010 to foster various business units dedicated to creating, disseminating, and managing knowledge-based products, services, and solutions. These offerings cater to corporate entities, startups, and academic institutions alike. Contact us: [email protected] © 2025| Passionate In Marketing |All Rights Reserved | Privacy Policy"
  },
  {
    "supplier": "Arvind Limited",
    "title": "Arvind Limited Announces Dr. Lakshyaraj Singh Mewar of Udaipur as Brand Ambassador for Primante Luxury Fabrics",
    "link": "https://theprint.in/ani-press-releases/arvind-limited-announces-dr-lakshyaraj-singh-mewar-of-udaipur-as-brand-ambassador-for-primante-luxury-fabrics/2028774/",
    "published": "2024-04-05T07:00:00.000Z",
    "text": "NewsVoir\n\n\n\n\n\n\nAhmedabad (Gujarat) [India], April 5: Arvind Limited, an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global and domestic customer base, proudly announces a strategic collaboration with, Dr. Lakshyaraj Singh Mewar of Udaipur, as the brand ambassador for Primante, its premium suiting & shirting brand.\n\n\n\t\t\t\t\tShow Full Article\n\t\t\t\t\t\n\n NewsVoir \n \nAhmedabad (Gujarat) [India], April 5: Arvind Limited, an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global and domestic customer base, proudly announces a strategic collaboration with, Dr. Lakshyaraj Singh Mewar of Udaipur, as the brand ambassador for Primante, its premium suiting & shirting brand.\n\n\n\t\t\t\t\tShow Full Article\n\t\t\t\t\t\n\n Ahmedabad (Gujarat) [India], April 5: Arvind Limited, an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global and domestic customer base, proudly announces a strategic collaboration with, Dr. Lakshyaraj Singh Mewar of Udaipur, as the brand ambassador for Primante, its premium suiting & shirting brand. \n \nMaharaj Kumar Sahib Dr. Lakshyaraj Singh Ji Mewar of Udaipur is a remarkable individual with diverse talents and achievements. His endeavors span across philanthropy, education, sports patronage, business leadership, captivating TED talks, and an impressive array of Guinness World Records. Since his youth, he has dedicated himself tirelessly to public service, championing noble causes with unwavering passion and selflessness.\n\n\n\n\n“I am honored to collaborate with Arvind as the brand ambassador for Primante Luxury Fabrics’, said Dr. Lakshyaraj Singh Mewar of Udaipur. “This partnership not only represents a union of heritage and innovation but also signifies our collective dedication to elevating the standards of luxury and sophistication in the realm of fashion. Together, we embark on a journey to inspire a lifestyle that embodies timeless elegance and refinement.”\n\n“We are pleased to welcome Dr. Lakshyaraj Singh Mewar of Udaipur to the Primante family,” said, Kulin Lalbhai, Executive Director, Arvind Ltd. “His association with our brand not only reinforces our commitment to excellence but also sets the stage for exciting collaborations and innovations in the luxury fashion space.” \n\nPrimante stands as the epitome of sophistication, with fabrics such as Australian Merino wool with Italian design to create exquisite suiting fabrics and Egyptian Giza and Supima Cotton Shirting. From Super 120s to Super 200s, Primante’s wide range showcases a fusion of fine count fabrics with blends including Silk, Mohair, Lycra, Linen, and innovative Poly filaments. Primante offerings extend beyond suit fabrics it also includes tweed jackets, business coats, and shirting, all crafted to the highest global standards of product development and quality control. The Primante collection is available at all “The Arvind Stores” and Multi-Brand Outlets.\n\nThis collaboration marks a significant milestone in Primante’s journey, positioning it firmly in the elite class of luxury fabrics. As the company continues to innovate and push the boundaries of textile technology, it is committed to bringing forth a range of Italian-inspired Designs that redefine luxury and sophistication.\n\nTogether with Dr. Lakshyaraj Singh Mewar of Udaipur, Primante embarks on a journey to inspire a lifestyle of luxury and refinement. Stay tuned as we unveil a series of ground-breaking initiatives that redefine the art of dressing in the modern era.\n\n\n\n\n‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month.\n\nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n Maharaj Kumar Sahib Dr. Lakshyaraj Singh Ji Mewar of Udaipur is a remarkable individual with diverse talents and achievements. His endeavors span across philanthropy, education, sports patronage, business leadership, captivating TED talks, and an impressive array of Guinness World Records. Since his youth, he has dedicated himself tirelessly to public service, championing noble causes with unwavering passion and selflessness. \n \n“I am honored to collaborate with Arvind as the brand ambassador for Primante Luxury Fabrics’, said Dr. Lakshyaraj Singh Mewar of Udaipur. “This partnership not only represents a union of heritage and innovation but also signifies our collective dedication to elevating the standards of luxury and sophistication in the realm of fashion. Together, we embark on a journey to inspire a lifestyle that embodies timeless elegance and refinement.”\n\n“We are pleased to welcome Dr. Lakshyaraj Singh Mewar of Udaipur to the Primante family,” said, Kulin Lalbhai, Executive Director, Arvind Ltd. “His association with our brand not only reinforces our commitment to excellence but also sets the stage for exciting collaborations and innovations in the luxury fashion space.” \n\nPrimante stands as the epitome of sophistication, with fabrics such as Australian Merino wool with Italian design to create exquisite suiting fabrics and Egyptian Giza and Supima Cotton Shirting. From Super 120s to Super 200s, Primante’s wide range showcases a fusion of fine count fabrics with blends including Silk, Mohair, Lycra, Linen, and innovative Poly filaments. Primante offerings extend beyond suit fabrics it also includes tweed jackets, business coats, and shirting, all crafted to the highest global standards of product development and quality control. The Primante collection is available at all “The Arvind Stores” and Multi-Brand Outlets.\n\nThis collaboration marks a significant milestone in Primante’s journey, positioning it firmly in the elite class of luxury fabrics. As the company continues to innovate and push the boundaries of textile technology, it is committed to bringing forth a range of Italian-inspired Designs that redefine luxury and sophistication.\n\nTogether with Dr. Lakshyaraj Singh Mewar of Udaipur, Primante embarks on a journey to inspire a lifestyle of luxury and refinement. Stay tuned as we unveil a series of ground-breaking initiatives that redefine the art of dressing in the modern era.\n\n\n\n\n‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month.\n\nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n “I am honored to collaborate with Arvind as the brand ambassador for Primante Luxury Fabrics’, said Dr. Lakshyaraj Singh Mewar of Udaipur. “This partnership not only represents a union of heritage and innovation but also signifies our collective dedication to elevating the standards of luxury and sophistication in the realm of fashion. Together, we embark on a journey to inspire a lifestyle that embodies timeless elegance and refinement.” \n \n“We are pleased to welcome Dr. Lakshyaraj Singh Mewar of Udaipur to the Primante family,” said, Kulin Lalbhai, Executive Director, Arvind Ltd. “His association with our brand not only reinforces our commitment to excellence but also sets the stage for exciting collaborations and innovations in the luxury fashion space.” \n\nPrimante stands as the epitome of sophistication, with fabrics such as Australian Merino wool with Italian design to create exquisite suiting fabrics and Egyptian Giza and Supima Cotton Shirting. From Super 120s to Super 200s, Primante’s wide range showcases a fusion of fine count fabrics with blends including Silk, Mohair, Lycra, Linen, and innovative Poly filaments. Primante offerings extend beyond suit fabrics it also includes tweed jackets, business coats, and shirting, all crafted to the highest global standards of product development and quality control. The Primante collection is available at all “The Arvind Stores” and Multi-Brand Outlets.\n\nThis collaboration marks a significant milestone in Primante’s journey, positioning it firmly in the elite class of luxury fabrics. As the company continues to innovate and push the boundaries of textile technology, it is committed to bringing forth a range of Italian-inspired Designs that redefine luxury and sophistication.\n\nTogether with Dr. Lakshyaraj Singh Mewar of Udaipur, Primante embarks on a journey to inspire a lifestyle of luxury and refinement. Stay tuned as we unveil a series of ground-breaking initiatives that redefine the art of dressing in the modern era.\n\n\n\n\n‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month.\n\nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n “We are pleased to welcome Dr. Lakshyaraj Singh Mewar of Udaipur to the Primante family,” said, Kulin Lalbhai, Executive Director, Arvind Ltd. “His association with our brand not only reinforces our commitment to excellence but also sets the stage for exciting collaborations and innovations in the luxury fashion space.”  \n \nPrimante stands as the epitome of sophistication, with fabrics such as Australian Merino wool with Italian design to create exquisite suiting fabrics and Egyptian Giza and Supima Cotton Shirting. From Super 120s to Super 200s, Primante’s wide range showcases a fusion of fine count fabrics with blends including Silk, Mohair, Lycra, Linen, and innovative Poly filaments. Primante offerings extend beyond suit fabrics it also includes tweed jackets, business coats, and shirting, all crafted to the highest global standards of product development and quality control. The Primante collection is available at all “The Arvind Stores” and Multi-Brand Outlets.\n\nThis collaboration marks a significant milestone in Primante’s journey, positioning it firmly in the elite class of luxury fabrics. As the company continues to innovate and push the boundaries of textile technology, it is committed to bringing forth a range of Italian-inspired Designs that redefine luxury and sophistication.\n\nTogether with Dr. Lakshyaraj Singh Mewar of Udaipur, Primante embarks on a journey to inspire a lifestyle of luxury and refinement. Stay tuned as we unveil a series of ground-breaking initiatives that redefine the art of dressing in the modern era.\n\n\n\n\n‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month.\n\nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n Primante stands as the epitome of sophistication, with fabrics such as Australian Merino wool with Italian design to create exquisite suiting fabrics and Egyptian Giza and Supima Cotton Shirting. From Super 120s to Super 200s, Primante’s wide range showcases a fusion of fine count fabrics with blends including Silk, Mohair, Lycra, Linen, and innovative Poly filaments. Primante offerings extend beyond suit fabrics it also includes tweed jackets, business coats, and shirting, all crafted to the highest global standards of product development and quality control. The Primante collection is available at all “The Arvind Stores” and Multi-Brand Outlets. \n \nThis collaboration marks a significant milestone in Primante’s journey, positioning it firmly in the elite class of luxury fabrics. As the company continues to innovate and push the boundaries of textile technology, it is committed to bringing forth a range of Italian-inspired Designs that redefine luxury and sophistication.\n\nTogether with Dr. Lakshyaraj Singh Mewar of Udaipur, Primante embarks on a journey to inspire a lifestyle of luxury and refinement. Stay tuned as we unveil a series of ground-breaking initiatives that redefine the art of dressing in the modern era.\n\n\n\n\n‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month.\n\nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n This collaboration marks a significant milestone in Primante’s journey, positioning it firmly in the elite class of luxury fabrics. As the company continues to innovate and push the boundaries of textile technology, it is committed to bringing forth a range of Italian-inspired Designs that redefine luxury and sophistication. \n \nTogether with Dr. Lakshyaraj Singh Mewar of Udaipur, Primante embarks on a journey to inspire a lifestyle of luxury and refinement. Stay tuned as we unveil a series of ground-breaking initiatives that redefine the art of dressing in the modern era.\n\n\n\n\n‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month.\n\nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n Together with Dr. Lakshyaraj Singh Mewar of Udaipur, Primante embarks on a journey to inspire a lifestyle of luxury and refinement. Stay tuned as we unveil a series of ground-breaking initiatives that redefine the art of dressing in the modern era. \n \n‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month.\n\nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n ‘The Arvind Store’ is a complete lifestyle fashion destination that focuses on bringing the best of both worlds, that of fabric and ready-made to its customers. It aims to revolutionize the whole shopping experience of customers by creating an enriching shopping experience through the convergence of Arvind’s strongest competencies under one roof. The stores house retail brands such as “AD”( Arvind Premium Ready-Made Collection), Fabric Brands like Primante & Tresca. It will also offer Custom Tailoring solutions to the customers. Select stores offer ADL (Arvind Denim Lab) – a unique model that allows customers to customise their denim with their size, fit and choice of buttons, rivets, labels, thread colours & initials. The Arvind Store concept is rapidly increasing across India, with multiple stores launching every month. \n \nArvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide.\n\nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n Arvind is a textile-to-retail conglomerate with a focus on textiles, apparels, advanced materials, environmental solutions, telecom and Omni-channel commerce. Arvind Limited is an integrated solutions provider in textiles with strong fiber-to-fashion capabilities for a global customer base. It is also a design powerhouse implementing innovative concepts and generating intellectual property. It ranks amongst the top suppliers of fabric worldwide. \n \nFor more information, please visit www.arvind.com.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n For more information, please visit www.arvind.com. \n \n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n (ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same) \n \nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content.\n\n\n\n\n This story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content. \n\n Subscribe to our channels on YouTube, Telegram & WhatsApp Support Our Journalism India needs fair, non-hyphenated and questioning journalism, packed with on-ground reporting. ThePrint – with exceptional reporters, columnists and editors – is doing just that. Sustaining this needs support from wonderful readers like you. Whether you live in India or overseas, you can take a paid subscription by clicking here. Support Our Journalism  \n\nSave my name, email, and website in this browser for the next time I comment.\n  \n\n Δ  Required fields are marked *  Name *  Email *   \n\n Δ Copyright © 2025 Printline Media Pvt. Ltd. All rights reserved."
  },
  {
    "supplier": "Arvind Limited",
    "title": "Arvind Limited Q1 Results: Net profit declines 31.4% at ₹70 crore, revenue down by 21.2% YoY",
    "link": "https://www.livemint.com/companies/company-results/arvind-limited-q1-results-net-profit-declines-31-4-at-rs-70-crore-revenue-down-by-21-2-yoy-11690464205040.html",
    "published": "2023-07-27T07:00:00.000Z",
    "text": "Arvind Limited on Thursday released the results for first quarter of FY 2024 and said its net profit was down 31.4% YoY at  ₹69.7 crore for June 23 from  ₹102 crore in the corresponding quarter of last year. Apart from this, the firm said that its revenue declined 21.2 percent at  ₹1,853.3 crore for Q1FY24 compared to  ₹2,352.1 crore in Q1FY22. The firm said that Q1 FY24 revenues is at  ₹1853 crore and EBIDTA is at 180 crore. However, the overall EBITDA margin improved by 30 bps on a YoY basis to 9.7 percent, it said in a stock regulatory filing.  Compared to Q1 of FY23, revenues and operating profits were lower by 21% and 18% respectively.  ALSO READ: Deepak Fertilisers Q1 Results: Net profit plunges 74% at  ₹114 crore, revenue declines 23.7% YoY “During the quarter, Arvind’s 24MW hybrid wind-solar project went live, that took Arvind’s total share of renewable energy consumption to 47%, and further strengthened its industry leading credentials in environmental sustainability,\" ” the firm said. “As per the guidance Arvind continued on its glide path of reducing Long Term debt, and reduced it by 19% ( ₹123 crores), overall debt reduced by  ₹26 crores during the quarter. Arvind Limited closed the quarter at a net debt of  ₹1301 crores,” it added.  Meanwhile, the Nomination and Remuneration Committee (NRC) of the firm, in the meeting held on 27 July, 2023, granted one lakh stock options to an eligible employee of the company under 'Grant – July 2023' pursuant to Employees Stock Option Scheme - 2021. The formula price or exercise price for stock has been fixed at  ₹10 apiece. Also, the Time within which option may be exercised has been fixed to 3 years from the date of vesting of stock option. Arvind Limited share traded 7.26% lower on Thursday at  ₹125.90 apiece on the BSE. Catch all the Business News ,  Corporate news , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment."
  },
  {
    "supplier": "Arvind Limited",
    "title": "Arvind Limited names Dr. Lakshyaraj Singh Mewar as Primanté Luxury Fabrics’ Brand Ambassador",
    "link": "https://www.medianews4u.com/arvind-limited-names-dr-lakshyaraj-singh-mewar-as-primante-luxury-fabrics-brand-ambassador/",
    "published": "2024-04-03T07:00:00.000Z",
    "text": "Arvind Limited proudly announces a strategic collaboration with His Highness, Dr Lakshyaraj Singh Mewar of Udaipur, as the brand ambassador for Primanté, its premium suiting & shirting brand, enhancing its global and domestic reach. Maharaj Kumar Sahib Dr. Lakshyaraj Singh Ji Mewar of Udaipur is a versatile individual excelling in philanthropy, education, sports, business, TED talks, and various Guinness World Records. Dedicated to noble causes from youth, he tirelessly champions public service with passion and selflessness. His Highness Dr Lakshyaraj Singh Mewar of Udaipur said, “I am honored to collaborate with Arvind as the brand ambassador for Primanté Luxury Fabrics. This partnership not only represents a union of heritage and innovation but also signifies our collective dedication to elevating the standards of luxury and sophistication in the realm of fashion. Together, we embark on a journey to inspire a lifestyle that embodies timeless elegance and refinement.” Kulin Lalbhai, Executive Director, Arvind Ltd said, “We are pleased to welcome Dr Lakshyaraj Singh Mewar of Udaipur to the Primanté family. His association with our brand not only reinforces our commitment to excellence but also sets the stage for exciting collaborations and innovations in the luxury fashion space.”  Primanté offers sophisticated fabrics like Australian Merino wool and Egyptian Giza cotton in suiting and shirting. Their range includes Super 120s to Super 200s blends with Silk, Mohair, and more. The collection extends to tweed jackets, business coats, and shirting with high-quality standards. Find Primanté at “The Arvind Stores” and Multi-Brand Outlets. This collaboration elevates Primanté to the elite class of luxury fabrics, showcasing innovation and Italian-inspired designs that redefine sophistication. Mumbai: Sting Energy®, PepsiCo’s electrifying energy drink, has officially entered the high-octane world of Formula 1® as its Official Energy... New Delhi: IOS Sports & Entertainment has unveiled a vibrant new logo to mark its 20th anniversary, commemorating a legacy... New Delhi: Kameda LT Foods, the joint venture between LT Foods, the Indian-origin global FMCG leader, and Japan’s Kameda Seika,... MUMBAI: Fitness and sports gear brand Boldfit has announced the onboarding of Team India pacer Arshdeep Singh as an official... New Delhi: BISSELL® has announced Bollywood superstar Kareena Kapoor Khan as its brand ambassador in India. This powerful collaboration brings... New Delhi: Magic Moments Vodka, the flagship vodka brand from Radico Khaitan, has announced the onboarding of Bollywood star Kriti... Mumbai: The Indian Premier League (IPL) 2025 continues to be a magnet for advertisers, with over 100 brands leveraging the... Mumbai: LS Digital has announced the elevation of three senior leaders into pivotal CXO roles, marking a strategic move to... Mumbai: Sting Energy®, PepsiCo’s electrifying energy drink, has officially entered the high-octane world of Formula 1® as its Official Energy... \n\n \n\n Mumbai: Zenith India has promoted Nisha Didwania to Senior Vice President, a move that underscores her pivotal role in driving... Goa: ABP Pvt. Ltd. has once again demonstrated its creative dominance by retaining the prestigious 'Publisher of the Year' title at the Publisher ABBY 2025... Let’s cut to the chase. AI is no longer that buzzword we discuss over agency chai breaks while wondering if... \n\n \n\n  Medianews4u.com © 2019 - 2024 All rights reserved.  Medianews4u.com © 2019 - 2024 All rights reserved."
  },
  {
    "supplier": "Arvind Limited",
    "title": "Tushar Nerkar joins Arvind Limited as chief marketing manager",
    "link": "https://www.afaqs.com/people-spotting/tushar-nerkar-joins-arvind-limited-as-chief-marketing-manager",
    "published": "2023-12-22T08:00:00.000Z",
    "text": "0 By clicking the button, I accept the Terms of Use of the service and its Privacy Policy, as well as consent to the processing of personal data. Don’t have an account? Signup  \n                            Powered by :\n                            \n\n\n\n\n\n   Follow Us   Previously, Nerkar was associated with Parag Milk Foods. Arvind Limited, a textile manufacturer and the flagship company of the Lalbhai Group, has appointed Tushar Nerkar as chief marketing manager. Nerkar posted about the development on LinkedIn. He started his career with Jet Airways as an intern. He successfully executed film marketing for Mardaani (July, 2014) and Bewakoofiyaan (March, 2014).  In 2015, Nerkar rejoined Jet Airways and worked with the company for 4 years. He shifted to Havmor Ice Cream in 2019 for the post of category manager. Nerkar completed his bachelors of management studies and marketing from V.E.S. college of Arts, Mumbai University. He studied masters from SPJIMR SP Jain Institute of Management & Research and completed MBA from Chetana's R. K. Institute of Management and Research. He specialises in brand marketing, brand strategy and brand communication.     Subscribe to our Newsletter!   \n                        Share this article \n                        If you liked this article share it with your friends.they will thank you later"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "CAL Investors Have Opportunity to Join Caleres, Inc. Fraud Investigation with the Schall Law Firm",
    "link": "https://www.globenewswire.com/news-release/2024/09/12/2945533/0/en/CAL-Investors-Have-Opportunity-to-Join-Caleres-Inc-Fraud-Investigation-with-the-Schall-Law-Firm.html",
    "published": "2024-09-12T07:00:00.000Z",
    "text": "September 12, 2024 15:13 ET\n\n\n | Source:\r\n            \nSchall Law\n\n\n\n\n\nSchall Law\n LOS ANGELES, Sept.  12, 2024  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces that it is investigating claims on behalf of investors of Caleres, Inc. (“Caleres” or “the Company”) (NYSE: CAL) for violations of the securities laws. The investigation focuses on whether the Company issued false and/or misleading statements and/or failed to disclose information pertinent to investors. Caleres reported its second quarter 2024 on September 12, 2024. The Company reported sales below analyst expectations and also lowered its yearly guidance. Based on this news, shares of Caleres fell by more than 19% in intraday trading on the same day. If you are a shareholder who suffered a loss, click here to participate. We also encourage you to contact Brian Schall of the Schall Law Firm, 2049 Century Park East, Suite 2460, Los Angeles, CA 90067, at 310-301-3335, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com, or by email at bschall@schallfirm.com. The Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation. This press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics. CONTACT: The Schall Law Firm Brian Schall, Esq. 310-301-3335info@schallfirm.com www.schallfirm.com"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "EXEC: Caleres Brand Portfolio Sees Tough Q2 on SAP Update while Famous FW Improving",
    "link": "https://sgbonline.com/exec-caleres-sees-tough-q2-for-brand-portfolio-on-sap-update-while-famous-fw-improving/",
    "published": "2024-09-12T07:00:00.000Z",
    "text": "Caleres, Inc., the parent company of Famous Footwear and the Naturalizer, Vionic, Allen Edmonds, Blowfish Malibu, and Sam Edelman brands said it reported second quarter sales and earnings that came in below expectations. “While our brands and our products continue to resonate with consumers and we remain committed to and confident in our long-term vision, our second quarter results fell short in both segments and do not reflect our true potential,” commented company President and CEO Jay Schmidt on a conference call with analysts. ERP and Execution Issues\nSchmidt said an ERP upgrade during the quarter was a significant part of the problem, but not the entire problem. “Lack of visibility caused execution issues that prevented us from delivering our expected results,” he confirmed. “As you are aware, we upgraded our SAP enterprise system to the new Cloud-based version,” the CEO explained. “This was a necessary upgrade that our teams have been working on for the past year, resulting in a common platform to leverage across our Brand Portfolio. Mid quarter, we were down for a few days as we planned.” Schmidt said when the systems came back online, they initially saw signs of a successful implementation with e-commerce and order shipping on track. However, as they progressed through the quarter, several key operational reports were delayed, causing a lack of visibility to the tools the company relies on to drive its business every day. Additionally, he said there were issues related to size reporting that initially made it difficult for them to service drop ship and replenishment orders. “And finally, we experienced late shipments and carrier failures that, while not related to the ERP implementation, contributed to the sales decline,” he said. “It is important to note that about 45 percent of our Brand Portfolio business is dynamic, including direct-to-consumer replenishment, drop ship and advancing newness. And without the tools and the reports to monitor these areas, we could not see all the issues until it was too late to fully recover.” In response, the company took several actions. “First, we immediately replaced one of our integration partners who handled reporting. Second, we pulled experienced order management professionals from elsewhere in our company and enlisted them to help ship out as many orders as possible. Third, we’ve gone function by function to shore up reporting and develop workarounds until the automated solutions are fully online,” the CEO explained. “Importantly, we are now operational in all areas that cause the ERP disruption and we have addressed the issues that temporarily impacted visibility. That said, we do not expect to recover all the missed sales with respect to seasonal categories, drop ship and other direct-to-consumer purchases,” he noted. He said the shortfall is factored into the updated guidance that they were sharing. Schmidt said they have also accelerated cost reduction initiatives to mitigate the impact on profitability. “To that end, today, we announced a restructuring that will save us approximately $7.5 million on an annualized basis and $2 million in this fiscal year,” he revealed. “These moves will make our teams more efficient and effective. Additionally, we are reducing other SG&A items for the back half to align with our forecast.” Operating Segments Brand Portfolio\nBrand Portfolio sales declined 5.1 percent to $285.5 million, compared to $300.9 million in the second quarter of 2023, said to be due to the issues related to the SAP upgrade impacting all brands as well as weakness in seasonal categories. Wholesale and drop ship were said to be down and own e-commerce was flat, but below expectations. “Based on our analysis, we believe the system issue resulted in about $10 million to $15 million of lost sales in the quarter, or as much as 5 percentage points of growth,” said company CFO Jack Calandra on the call. “We continue to see strong growth in demand for new products and momentum in fashion sneakers, Schmidt shared. “In fact, sneakers and sport represented 28 percent of retail selling for the quarter, up six points versus the prior year. Seasonal products continued to underperform with sandals down high-single digits versus last year. We are well positioned in sneakers going forward and have aligned our inventory with consumer demand for this trending category.” Higher initial margin rates and a favorable channel mix resulted in a 140 basis point year-over-year improvement in segment gross margin to 42.7 percent of sales. “This demonstrates the health of our business overall,” the CEO noted. “Our 8.3 percent return on sales for the Brand Portfolio was down to last year due to deleveraging of expenses.” Schmidt said inventory in the Brand Portfolio was in good shape, “about flat to last year” with a reduction in aged inventory. “Our four lead brands, which include Sam Edelman, Allen Edmonds, Naturalizer and Vionic, represented more than half of the Brand Portfolio’s sales in the quarter,” he noted. “While sales were down for the lead brands, in total, they outperformed the other brands in our portfolio.” Schmidt said a few highlights from the quarter demonstrate that the company’s growth vectors are still on track. On the international front, Schmidt said they are very pleased with Sam Edelman’s momentum. “What we are seeing in Asia is giving us increased conviction in our strategy there.” Allen Edmonds’ wholesale door count is up 30 percent year-over-year, and they continue to see a strong response at Nordstrom and other strategic specialty accounts. Schmidt said the company also continues to attract new consumers to brands like Naturalizer. “There, I hope you noticed that we are moving forward with Deepica Mutyala and Lauren Chan as our first inclusivity ambassadors starting with a campaign centered around our sizing initiatives and wide shaft boots. We are already seeing a strong reaction in early fall to our tall boots, especially in wide shaft,” he detailed At Vionic, he said the Uptown Moc franchise reportedly continues to introduce the brand to new consumers with more modern and relevant fashion that embodies wearable well-being. “Overall, the Brand Portfolio had a difficult quarter. However, we have full confidence in our growth vectors. Our retail sell throughs in the quarter were strong. We are well positioned from an inventory perspective in sneakers, and many of our brands have growth and receipt plans for the back half to support our guidance. This was a moment that is not indicative of our future potential,” he concluded. Famous Footwear\nFamous Footwear total sales were up 1.5 percent to $420.3 million in the second quarter, while comp sales declined 2.9 percent. The quarter included a $23 million benefit to Famous Footwear due to the retail calendar shift that pulled a peak back-to-school week into the quarter from August. “Despite sales that were lower than anticipated, we delivered sequential improvement in each month of the quarter,” Schmidt shared. “We saw our Athletic trend build in July as the back-to-school season began, and we aligned our assortment with trending categories and brands. Notably, our strategically important Kids’ category once again grew in the quarter and Kids’ outpaced the total business.” Calandra said they saw sequential improvement in each month of the quarter at Famous and that improvement continued with a strong performance in August. The Kids’ business has now reportedly outperformed the rest of the chain for 14 consecutive quarters. Kids’ penetration of the total Famous Footwear business was 21 percent in the quarter. Schmidt said the retailer gained 0.5 points of market share of the Kids’ business in shoe chains, according to recent market research data. “Also in the second quarter, Famous Footwear’s market share was flat to the total footwear market overall and gained 0.5 points in shoe chains,” he noted. “We were also pleased with the performance of our own brands at Famous,” the CEO continued. “Penetration of our Caleres brands was once again up in the quarter. Our own portfolio provides Famous with greater access to fashion products. And at an enterprise level, Caleres captures a higher gross margin on brands sold vertically.” The Famous.com business was said to be “solid” in the quarter, up 10 percent year-over-year with much of the business fulfilled through the FF stores. Famous Footwear gross margin slipped 120 basis points year-over-year to 45.0 percent of sales, said to be due to more days on promotion and the pull forward of theBOGO 50 offer as well as higher clearance activity.  “While we utilize the BOGO 50 offer earlier than planned, we believe we maximize gross profit, given the initial tepid response to our buy more, save more promotion,” Calandra added. “Finally, we continue to further our efforts to enhance the consumer experience at Famous,” Schmidt noted. “At the end of Q2, we had 31 FLAIR (Famous Localized and Immersive Retail) locations in total,” he said. “We experienced a 5 point sales lift versus the rest of the chain in our fall 2023 and spring 2024 FLAIR stores. Those of you that shop there may notice an expanded assortment of brands like New Balance and Brooks. FLAIR is helping us attract these and other more elevated brands and products, and our Famous consumer is responding. We are on track to remodel 12 additional FLAIR stores in the back half of this year.” Schmidt said the back-to-school business came late, but it came in strong and he said they are pleased with where the season ended up. “Early in the year, we saw a stronger Athletic business materializing and worked hard to align our inventory investment with emerging trends for back-to-school,” he explained. “In mid-July, we launched new marketing messages and shifted our marketing mix to channels that were driving the most traffic. We also shifted our promotional strategy to BOGO from buy more, save more, after conducting a test that showed BOGO was margin dollar accretive. In August, we experienced a high-single-digit positive comp store sales gain.” As a result, through August, he said Famous Footwear comp sales are now about flat for the full year-to-date period. “The Athletic trend continued to build and turned positive with strength in Nike and Adidas amongst others,” he continued. “Furthermore, we are seeing strength in Men’s and Women’s alongside continued outperformance in Kids’. While we see these trends normalizing now that the back-to-school season is over, our results suggest our product, marketing and promotional messages are resonating with the millennial family.” Schmidt said the strength of Kids’, the FLAIR results, and the trend in August lead the company to a place of cautious optimism at Famous Footwear. “We believe Famous’ inherent competitive advantages, namely its leadership position with the millennial family, especially kids, coupled with its clear avenues for growth and support from the Caleres structure position the business to gain additional market share in shoe chains, generate robust levels of cash and increase profitability over the long-term,” he said. Income Statement Summary\nConsolidated gross margin (GM) improved 30 basis points year-over-year (y/y) to 45.5 percent of sales, and was said to be driven by higher margin in the Brand Portfolio, partially offset by the lower margins at Famous Footwear. Consolidated SG&A, as a percent of net sales, was 39.3 percent, and it was said to reflect planned investment in marketing at certain Lead Brands, international expansion, and the implementation of the integrated SAP platform. The company said restructuring actions will result in $7.5 million in annualized SG&A savings and $2 million in SG&A savings in fiscal 2024. Consolidated operating earnings were $42.5 million and operating margin was 6.2 percent of sales. Operating margin was 8.2 percent at Brand Portfolio and 8.3 percent at Famous Footwear. Net interest expense was $3.3 million, down about $2.0 million from last year. The reduction was reportedly driven by lower borrowings as the weighted average borrowing rate was similar to last year. Consolidated net earnings amounted to $30.0 million, or 85 cents per diluted share, in the second quarter, compared to net earnings of $33.9 million, or 95 cents per diluted share, in the second quarter of 2023, and Adjusted net earnings were calculated at $35.2 million, or Adjusted EPS of 98 cents per diluted share, in the second quarter of 2023. EBITDA was $57 million, or 8.4 percent of sales, for the quarter. Balance Sheet Summary\nInventory was flat at quarter-end compared to the end of the second quarter of 2023. Inventory was was said to be “up slightly” at Famous Footwear and “down slightly” at Brand Portfolio.  Borrowings under the asset-based revolving credit facility were $146.5 million at the end of the period, down $98 million from the second quarter of 2023, and included the benefit from a deferred vendor payment of $49 million. The company had no long term debt at quarter-end. “I would note that one of our vendors had issues receiving payments later in the quarter, which resulted in a planned payment of $49 million being pushed into August,” Calandra added. Caleres generated generated $80 million in cash flow from operations in the quarter, which reportedly included the favorable impact of the deferred vendor payment. Capital Allocation Update\nDuring the quarter, Caleres said it continued to invest in value-driving growth opportunities while at the same time returning cash to shareholders through a dividend. In the near term, the company expects to continue to focus on reducing debt and expects borrowings under its asset-based revolving credit facility to be less than $100 million by 2026. Caleres said it will continue to consider business performance and market conditions as it evaluates all opportunities for free cash flow, including share repurchases, as the year progresses. Fiscal 2024 Guidance\nCaleres revised its fiscal 2024 financial outlook to reflect the shortfall experienced in Q2, the strong August results at Famous, and the restructuring actions the company announced in its earnings release and call.  “Specifically, we now expect sales to be down a low-single-digit percent versus last year,” Calandra noted. “This comparison includes the impact of the 53rd week in 2023. Excluding the 53rd week, sales would be flat to down 2 percent.”  He said EPS are estimated at a range of $3.94 to $4.09 per diluted share, and Adjusted EPS are estimated in a range of $4.00 to $4.15 per share, which includes about $2 million of savings and excludes $3 million of one-time costs associated with the restructuring. “Additionally, we now expect consolidated operating margin of 7.o percent to 7.1 percent and capital expenditures of $50 million to $55 million,” Calandra estimated. “Given the continued strength of e-commerce relative to stores in Famous, we will close an additional 10 stores this year and expect to end the year with 850 stores versus 860 stores last year. And lastly, we still expect an effective tax rate of about 24 percent.” Third Quarter Guidance\nCaleres, Inc. now expects consolidated net sales to be flat to down 2 percent in Q3, a cash restructuring charge of $3 million and earnings per diluted share of $1.24 to $1.34 and Adjusted earnings per diluted share of $1.30 to $1.40. As previously noted, its fiscal 2024 is a 52-week year and compares to a 53-week year in fiscal 2023. The revised assumptions are summarized as follows:   * Adjusted EPS excludes 6 cents per share ($3 million) expected to occur in the third quarter.associated with restructuring costs. Image courtesy Famous Footwear/Flair Follow us on: \n\nEXEC: Giant Group Posts 29 Percent Net Profit Decline; Sales Up 4.9 Percent\n\nMay 27, 2025\n\n\n\n\n\n\nEXEC: Go Sport and Al Mana Add Key Sporting Goods Execs\n\nMay 27, 2025\n\n\n\n\n\n\nEXEC: Norrøna Partners with Topsports for China Retail Presence\n\nMay 27, 2025\n\n\n\n\n\n\nEXEC: Deckers Shares Plunge on Weaker Hoka Growth in Q4 and Q1 Guide Miss\n\nMay 23, 2025\n\n\n\n\n\n\nEXEC: Tariff Worries Overhang NSGA Leadership Conference Energy\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Wilson Ball & Racquet Segment Continues DD Growth for Amer Sports\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Colt CZ Sees Robust Q1 Results; Acquires U.S.-Based Valley Steel Stamp\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Nike Rolls Out Price Increase Schedule\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Nike Brand Re-Engages with Amazon to Sell Direct to Customers\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Arc’teryx Still King at Amer Sports But Growth Trend Moderates\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: VF Q4 Profits Beat Plan as TNF and Timberland Deliver Healthy Growth\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: Vans Hits Fiscal Q4 Turbulence as Brand Recovery Falters   \n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: New Hibbett Parent JD Sports Sees Shares Fall as Q1 Disappoints\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: Salomon Footwear Continues to Boost the Brand and Parent Amer Sports\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: Amer Sports C-Suite Details Small Tariff Impact and FY Guidance Bump\n\nMay 20, 2025\n\n\n\n\n Read More SGB Executive Stories ©2025 SGB Media. All rights reserved. Use of this Site constitutes acceptance of our Terms & Conditions and Privacy Policy.The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of SGB Media."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Caleres Inc (CAL) Q3 Earnings: EPS at $1.19, Revenue Hits $740.9 Million, Both Miss Estimates",
    "link": "https://www.gurufocus.com/news/2624320/caleres-inc-cal-q3-earnings-eps-at-119-revenue-hits-7409-million-both-miss-estimates",
    "published": "2024-12-05T08:00:00.000Z",
    "text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. \nCloudflare Ray ID: 9466cae47909fdcf\n•\n\n      Your IP:\n      Click to reveal\n2409:40f2:49:295d:ad7c:1c7d:beb:4c79\n•\n\nPerformance & security by Cloudflare"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Earnings Working Against Caleres, Inc.'s (NYSE:CAL) Share Price Following 25% Dive",
    "link": "https://simplywall.st/stocks/us/retail/nyse-cal/caleres/news/earnings-working-against-caleres-incs-nysecal-share-price-fo",
    "published": "2024-12-22T08:00:00.000Z",
    "text": "Stock Analysis  The Caleres, Inc. (NYSE:CAL) share price has fared very poorly over the last month, falling by a substantial 25%.    The drop over the last 30 days has capped off a tough year for shareholders, with the share price down 23% in that time.     Even after such a large drop in price, Caleres' price-to-earnings (or \"P/E\") ratio of 5.2x might still make it look like a strong buy right now compared to the market in the United States, where around half of the companies have P/E ratios above 19x and even P/E's above 34x are quite common.  Although, it's not wise to just take the P/E at face value as there may be an explanation why it's so limited.     Recent earnings growth for Caleres has been in line with the market.   One possibility is that the P/E is low because investors think this modest earnings performance may begin to slide.  If not, then existing shareholders have reason to be optimistic about the future direction of the share price.       Check out our latest analysis for Caleres   There's an inherent assumption that a company should far underperform the market for P/E ratios like Caleres' to be considered reasonable.    Retrospectively, the last year delivered virtually the same number to the company's bottom line as the year before.   However, a few strong years before that means that it was still able to grow EPS by an impressive 640% in total over the last three years.  Therefore, it's fair to say the earnings growth recently has been superb for the company.     Turning to the outlook, the next three years should bring diminished returns, with earnings decreasing 4.1%  per year as estimated by the four analysts watching the company.  With the market predicted to deliver 11% growth  per annum, that's a disappointing outcome.   With this information, we are not surprised that Caleres is trading at a P/E lower than the market.  Nonetheless, there's no guarantee the P/E has reached a floor yet with earnings going in reverse.  There's potential for the P/E to fall to even lower levels if the company doesn't improve its profitability.    Caleres' P/E looks about as weak as its stock price lately.      It's argued the price-to-earnings ratio is an inferior measure of value within certain industries, but it can be a powerful business sentiment indicator.   As we suspected, our examination of Caleres' analyst forecasts revealed that its outlook for shrinking earnings is contributing to its low P/E.  At this stage investors feel the potential for an improvement in earnings isn't great enough to justify a higher P/E ratio.  It's hard to see the share price rising strongly in the near future under these circumstances.      Having said that, be aware  Caleres is showing 1 warning sign in our investment analysis, you should know about.    If you're unsure about the strength of Caleres' business, why not explore our interactive list of stocks with solid business fundamentals for some other companies you may have missed.  Our new AI Stock Screener scans the market every day to uncover opportunities. • Dividend Powerhouses (3%+ Yield)• Undervalued Small Caps with Insider Buying• High growth Tech and AI CompaniesOr build your own from over 50 metrics. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Engages in the designs, develops, sources, manufactures, and distributes footwear in the United States, Canada, East Asia, and internationally. Flawless balance sheet, undervalued and pays a dividend. Financial Data provided by S&P Global Market Intelligence LLC, analysis provided by Simply Wall Street Pty Ltd. Copyright © 2025, S&P Global Market Intelligence LLC. All rights reserved. Markets Investing Ideas Features Simply Wall St Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. © 2025 Simply Wall Street Pty Ltd, US Design Patent #29/544/281, Community and European Design Registration #2845206"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Why Caleres Stock Plunged Today",
    "link": "https://www.fool.com/investing/2024/09/12/why-caleres-stock-plunged-today/",
    "published": "2024-09-12T07:00:00.000Z",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation. \n       You're reading a free article with opinions that may differ\n       from The Motley Fool's Premium Investing Services. Become a Motley Fool member today to\n       get instant access to our top analyst recommendations, in-depth research, investing resources,\n       and more. Learn More\n Key Points The footwear retailer's latest results disappointed the market. Shares of Caleres (CAL 1.88%), the parent of Famous Footwear and other footwear brands, were tumbling today after the company posted disappointing results in its second-quarter earnings report. As of 11:34 a.m. ET, the stock was down 19.1% on the news. Image source: Getty Images. Caleres said revenue in the quarter was down 1.8% to $683.3 million, well below estimates at $723.8 million. Famous Footwear sales rose 1.5%, which included a later-than-expected back-to-school season, with most sales occurring in the third quarter. Brand portfolio sales declined 5.1% due to some weak seasonal demand and challenges with its new enterprise resource planning system implementation. Despite weaker-than-expected sales, gross margin rose 30 basis points to 45.5%, though selling, general, and administrative expenses were up 2% to $268.3 million. On the bottom line, the company finished with a profit per share of $0.85, down from $0.95 in the quarter a year ago and missing the consensus at $1.22. CEO Jay Schmidt acknowledged the disappointing results, saying, \"Caleres reported second-quarter results that were below expectations. While our brands and products continue to resonate with consumers and we remain confident in our long-term vision, our second-quarter results in both segments fell short of our potential.\" Management also lowered its full-year guidance. It now sees sales down by the low single digits, compared to an earlier forecast of flat to up 2%, and cut adjusted earnings per share (EPS) guidance to $4.00-$4.15 from $4.30-$4.60. For the third quarter, it called for sales to be down flat to 2% and adjusted EPS of $1.30-$1.40, short of the consensus at $1.50. Caleres didn't explicitly blame macro factors in the report, but the disappointing results follow similar numbers from fellow footwear stock DSW-parent Designer Brands yesterday, which also fell on its earnings report. That could be favorable to Caleres as the stock looks cheap at a forward price-to-earnings ratio of less than 8 after today's decline. If the business can shift back to positive growth, it should recover today's losses. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool recommends Designer Brands. The Motley Fool has a disclosure policy. Stocks Mentioned *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles \n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n       Making the world smarter, happier, and richer. © 1995 - 2025 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. About The Motley Fool Our Services Around the Globe Free Tools Affiliates & Friends"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Caleres Taps Nancy Bitetto as Head of New York Brands",
    "link": "https://footwearnews.com/business/executive-moves/caleres-nancy-bitetto-head-of-new-york-brands-1234730544/",
    "published": "2024-11-14T08:00:00.000Z",
    "text": "The Pioneer Magnolia Spectator drops May 27 in a two nostalgic colorways with soft spikes and brogue detailing.\t Sign up for Footwear News straight to your inbox every day Only $24.99 for one year! Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2025 Fairchild Publishing, LLC. All Rights Reserved."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Caleres Inc (CAL) Q2 2024 Earnings: EPS of $0.85 Misses Estimates, Revenue of $683.3 Million Falls Short",
    "link": "https://www.gurufocus.com/news/2522643/caleres-inc-cal-q2-2024-earnings-eps-of-085-misses-estimates-revenue-of-6833-million-falls-short",
    "published": "2024-09-12T07:00:00.000Z",
    "text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. \nCloudflare Ray ID: 9466cb566bd9ce52\n•\n\n      Your IP:\n      Click to reveal\n2409:40f2:49:295d:ad7c:1c7d:beb:4c79\n•\n\nPerformance & security by Cloudflare"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Caleres, Inc. (NYSE:CAL) Q3 2024 Earnings Call Transcript",
    "link": "https://www.insidermonkey.com/blog/caleres-inc-nysecal-q3-2024-earnings-call-transcript-1403428/",
    "published": "2024-12-06T08:00:00.000Z",
    "text": "Our #1 AI Stock Pick is on a steep discount - 29.99$ instead of 99.99$! Click here to access exclusive investment research and ad free browsing! Our #1 AI Stock Pick is on a steep discount - 29.99$ instead of 99.99$! Click here to access exclusive research! Caleres, Inc. (NYSE:CAL) Q3 2024 Earnings Call Transcript December 5, 2024 Caleres, Inc. misses on earnings expectations. Reported EPS is $ EPS, expectations were $1.37. Operator: Good morning. And welcome to the Caleres Third Quarter 2024 Earnings Conference Call. My name is Daryl, and I’ll be your conference coordinator. At this time, all participants are in listen-only mode. A question-and-answer session will follow the prepared remarks [Operator Instructions]. As a reminder, this conference is being recorded. At this time, I’ll turn the call over to Liz Dunn, Senior Vice President of Strategic Communications and Corporate Development. Please go ahead. Liz Dunn: Thank you, Daryl. Good morning. And thank you for joining our third quarter 2024 earnings call and webcast. A press release with detailed financial tables as well as our quarterly slide presentation are available at caleres.com. Please be aware today’s discussion contains forward-looking statements, which are subject to several risks and uncertainties. Actual results may differ materially due to various risk factors, including those disclosed in the company’s Form 10-K and other filings with the US Securities and Exchange Commission. Please refer to today’s press release and our SEC filings for more information on risk factors and other factors, which could impact forward-looking statements. Copies of these reports are available online.   In discussing our operating results, we will be providing and referring to certain non-GAAP financial measures. Additional details on these measures as well as others featured in today’s earnings release and presentation are available at caleres.com. The company undertakes no obligation to update any information discussed in this call at any time. Joining me today are Jay Schmidt, President and CEO; and Jack Calandra, Senior Vice President and CFO. Our call will begin with prepared remarks followed by a Q&A session to address any questions you have. With that, I’ll turn the call over to Jay. Jay Schmidt: Thank you. And good morning, everyone. As we reported earlier today, our third quarter saw progress toward our strategy, highlighted by the brand portfolio reporting growth, Famous Footwear delivering positive comp store sales and both segments increasing market share. However, our earnings were clearly below our expectations. There were a number of challenges in the quarter that impacted our results; we saw a soft boot sales in both segments of our business; we had discrete issues with late receipts of trending athletic product at Famous Footwear; we had a credit issue associated with one customer in the brand portfolio that resulted in lower shipments; and finally, our China business has softened. While this was not the result we wanted, there were several areas of strength on both sides of our business that leave us cautiously optimistic for the future.  Our brands and products are resonating with consumers. We are gaining market share in both segments of our business. And we remain confident in our growth strategies and long term vision. In total, for the third quarter, sales declined 2.8% year-over-year and we reported adjusted earnings per share of $1.23. Now let’s turn to our operating segments. Brand portfolio sales increased approximately 1%. Our lead brands outperformed our portfolio brands with wholesale and owned dot com both showing modest growth versus last year. We were encouraged to see a return to growth and pleased to report that the issues that we had last quarter related to our systems implementation did not impact this quarter. Additionally, our brand portfolio gained market share according to Circana during the quarter, both in total and in women’s fashion footwear.  We continue to see robust demand for new products with momentum in fashion sneakers. In fact, sneakers and sport represented over 30% of retail selling for the quarter. Slingbacks, Mary Janes, and ballet flats also performed very well. Wholesale boot shipments, however, declined 5% versus last year. However, at retail, short boots were down 18% and tall shaft boots were up slightly. Wide shaft boots stood out with double digit growth to last year. In the boot category, much like in the rest of our business, the consumer is prioritizing trends and newness over basics. And more broadly, brands with premium positioning outperformed. From an inventory perspective, we have more current less core and less aged inventory. In addition, our speed initiative drove about 30% of our sourcing in the quarter.  Our lead brands Sam Edelman, Allen Edmonds, Naturalizer and Vionic represented more than half the brand portfolio sales and operating earnings in the quarter. Three of those four brands saw growth and collectively lead brand growth exceeded that of the portfolio brands. The Sam Edelman brand saw strength in the quarter driven by positive response to fashion newness, particularly in sneakers, flats and tall shaft boots. Sales in Sam Edelman retail stores exceeded expectations and retail sell throughs with our wholesale accounts were up year-over-year. Sam introduced handbags under license in October and we are encouraged by the positive early reaction. And finally, we continue to believe Sam Edelman has a significant opportunity internationally.  During the quarter, the brand launched in Selfridges and John Lewis in the UK and unveiled the first global location for Sam Edelman’s new store concept in Shanghai in October. The Allen Edmonds business was also driven by newness, particularly in new sneakers and dress loafers while boots underperformed. We successfully launched our new Allen Edmonds reserve collection across all channels during the quarter, including an exclusive collection with Bergdorf Goodman. In our retail stores, we continue to see success with our Port Washington Studio store concept and now have 11 of these prototypes with comp stores outperforming the chain by a high single digit percentage. Naturalizer returned to growth in Q3, led by its direct-to-consumer business.  We saw increases in purchasing by Gen Z, millennials and higher household income consumers. Boot sales here were solid, driven by growth and expanded [calf width]. Our focus on inclusivity is attracting new loyal consumers to the brand. Additionally, we also opened a new store in Beijing, relaunching the Naturalizer brand in Asia and are in early innings of international expansion for this brand. Vionic had solid trends at retail, particularly with Nordstrom and saw continued outperformance in both its uptown casual business and the sport lifestyle category. However, the brand faced challenge again with casual short boots. We continue to evolve and modernize the assortment while maintaining Vionic’s wearable wellbeing positioning. And as we continue to fuel innovation at Vionic, we expect to further expand the brand’s reach.  Overall, the brand portfolio had a mixed quarter. Outperformance by our lead brands is encouraging and strong retail selling trends and market share gains across the portfolio will drive growth in the future. Moving on to Famous Footwear. Total sales declined 5% during the third quarter, while comp sales increased 2.5%. After a very strong back to school season, sales returned to the prior trend. Athletic was strong and positive across men’s, women’s and kids. Boots were down over 20% at Famous during the quarter comprising most of the sales shortfall relative to expectations. At the same time, we saw an extended season for sandals selling with strength from both Birkenstock and REEF. Once again, our strategically important kids category grew in the quarter outpacing the total business.  Our kids category has now outperformed the rest of the chain for 15 consecutive quarters. Kids penetration of the total Famous business was 25% in the quarter and we gained 1.3 points of kids’ market share in shoe chains according to Circana data. Overall, in the third quarter, Famous Footwear’s market share gained a 0.5 point in shoe chains according to Circana data. We were also pleased with our performance of our own brands at Famous. Penetration of our Caleres brands was once again up in the quarter with strong selling for both Naturalizer and Blowfish. Caleres brands continue to provide Famous with greater access to fashion products. While at the enterprise level, vertical sales allowed us to capture higher gross margins. Our famous.com business was strong in the quarter posting an 8.3% year-over-year increase on a comp basis.  Finally, we continue to focus on enhancing the consumer experience at Famous. At the end of Q3, we had 32 FLAIR locations in total. We continue to experience a mid-single digit sales lift versus the rest of the chain in our fall 2023 and spring 2024 FLAIR stores. FLAIR is successfully attracting more elevated brands and products, and our Famous consumer is responding positively. We made a tactical decision to delay construction on additional remodels until the first quarter of 2025 to prevent lost holiday sales. However, we will open one new FLAIR store in Boston in the fourth quarter. Famous is well positioned on inventory heading into the holiday season, particularly in the key trending brands and styles. The strength of kids, our continued success with FLAIR and our broad based improvement in athletic are encouraging.  We believe Famous’ inherent competitive advantage, namely its leadership position with the millennial family, especially kids, coupled with its clear avenues for growth and support from the Caleres structure, position the business to gain additional market share in shoe chains, generate robust levels of cash and increase profitability over the long term. Looking forward, we are now expecting lower sales and earnings than our previous guidance. While Jack will walk you through our updated assumptions in detail. I will provide some color on the factors impacting our revised outlook. We are seeing several trends play out in our business that are negatively impacting our top line performance in the near term. On the brand portfolio side, we expect boots to continue to trend below last year through the fourth quarter.  We plan to take aggressive action on poor performing items to end the year in a clean position. We also expect demand in China to be more muted than previous expectations for the balance of the year. At Famous Footwear, we are outperforming in our competitive set but the overall environment in family footwear has been more challenged. Lastly, we incurred necessary investment this year to position our business for the long term. We have restructured our business and reduced expense but we do not want to set back long term growth plans by cutting too deeply. Finally, I would also like to touch on two subjects, tariffs and our long term plan. First on tariffs, our sourcing and supply chain capabilities are well positioned to adapt and evolve to meet the changing environment.  We have been working closely this year with our factory partners to pivot our sourcing outside of China and mitigate the impact of additional tariffs on the business for 2025. Jack will discuss this with more detail on our sourcing plans shortly. Second, on the subject of our long term financial targets. In October of 2023, we announced a plan to drive growth in sales, earnings and total shareholder return. While we still expect to return to more consistent growth in these metrics, we now expect it to take longer to achieve the specific EPS goals we laid out last October. This year has clearly been a setback for us. Having said that, we believe we are on the right track with the right strategies for the future. We look forward to updating you on our 2025 expectations during our fourth quarter call.  And with that, I will now hand it over to Jack for a more detailed view of our financial performance and our outlook. Jack? Jack Calandra: Thanks Jay. And good morning, everyone. During today’s call, I’ll review our third quarter performance and share our revised guidance for the full year. Please note my comparisons to last year will be on an adjusted basis. Starting with Q3 results, sales were $741 million, down 2.8%. On a dollar basis, sales were down $21 million, which included an unfavorable calendar shift of about $29 million at Famous. As Jay mentioned, weak seasonal demand in the boot category impacted results in both segments. Brand portfolio sales were up 0.7%, primarily driven by our lead brands. Owned dot com sites were up 1%. Drop-ship improved from Q2 and was about flat versus last year and total wholesale saw a modest uptick. Famous sales were down 4.8%.  Comparable sales, which adjust for the calendar shift, were up 2.5%. Strong results in athletic and kids offset weak sales in boots. Back to school came later in the season but in total was in line with our expectations. Comparable sales were up 9% in August and down low single digits in September and October. Consolidated gross margin was 44.1%, a 55 basis point decrease and was driven by lower margin in Famous, partially offset by a slightly higher margin in brand portfolio. Brand portfolio gross margin was 43.8%, up 15 basis points supported by a favorable channel mix and higher initial margins. Famous gross margin was 42.9%, down 130 basis points. This decrease reflects a shift to more days in BOGO versus buy more, save more. However, as previously noted, the shift was gross profit accretive to what we initially saw from the buy more, save more promotion.  Softer than anticipated performance in boots also impacted clearance margins. SG&A expense was $269 million or 36.3% of sales, up 30 basis points. SG&A declined $5 million as a result of our restructuring actions and lower incentive compensation costs and were somewhat offset by higher rent and investments in marketing, the SAP upgrade and international. Operating earnings were $58 million and operating margin was 7.9%. Operating margin was 10.9% at brand portfolio and 6.9% at Famous. Net interest expense was $2.9 million, down $1.6 million on lower average borrowings and a lower interest rate. Earnings per diluted share were $1.23 versus $1.37 last year. EBITDA was $73 million and 9.9% of sales. Turning now to the balance sheet. We ended the third quarter with $239 million in borrowings, up about $17 million versus last year.  The borrowings balance included the impact of $50 million of share buybacks completed in the quarter during which we repurchased just over 1.5 million shares at an average price of $32.82 per share. Debt to trailing 12 month EBITDA was 1 times. Inventory at quarter end was $586 million, up 5.4% to last year on a reported basis and up 2.7% when adjusted for the calendar shift. Famous inventory was up 5.1% on a reported basis and up 0.7% on an adjusted basis. Brand portfolio inventory was up 6%. Both businesses ended the quarter with less aged inventory than last year in both dollars and as a percent to total. Now turning to our outlook. We are updating our full year 2024 guidance to reflect the shortfall we experienced in Q3 and a more conservative view of Q4.  We now expect sales to be down 2.5% to 3% versus last year. This comparison includes the impact of the 53rd week in 2023. Excluding the 53rd week, sales to be down 1.5% to 2%. We expect consolidated operating margin of 6.1% to 6.3% and earnings per diluted share of $3.35 to $3.45 and adjusted earnings per diluted share of $3.45 to $3.55. We continue to expect an effective tax rate of about 24% and capital expenditures of $50 million to $55 million. We have provided a table in our earnings release and slides that summarizes our previous and revised guidance. And finally, I wanted to build on Jay’s earlier comments on the evolving tariff situation. On the brand portfolio side of our business where we source product directly, more than 50% of our dollar volume is currently manufactured outside of China.  We expect to have about 70% sourced outside of China by the back half of 2025 and our lead brands are further along on this migration. At Famous, currently about 15% of our vendor receipts are made in China. We expect this number to move lower as well. We are working proactively to mitigate the risk of additional tariffs and believe our sourcing capabilities position us well to adapt to any changes. With that, we can open the line for questions. Operator? Operator: [Operator Instructions] Our first questions come from the line of Ashley Owens with KeyBanc Capital Markets. Chandana Madaka: This is Chandana Madaka on for Ashley Owens this morning. So I just wanted to ask just broadly, your year into your long term plan that you outlined at Investor Day. Can you just provide more thoughts around the confidence levels, how should we be thinking about top line growth and scaling to that in next year and beyond? Is there any shift in the makeup there? And then you spoke to EPS expectations that are now expected to take a bit longer. So from an OpEx perspective, is there anything to call out on what’s driving the adjustment? Any bucket that’s contributing more? Jack Calandra: So as you know, we generated more than $4 of EPS over the last three years and continue to believe we have the brand, strategies, capabilities and people to get back to that earnings power. As Jay said, this year has clearly been a setback. And I really think without making excuses there have been a confluence of factors that have impacted this year. One thing I would say is that the fashion segment of footwear where we obviously play pretty heavily has been softer than anticipated from the forecast that we were provided in the beginning of the year, and the seasonal business has been particularly tough. As you know from our second quarter call, we also had disruption and distraction from our ERP upgrade and that had a pretty big impact on Q2.  As Jay mentioned that impact is now behind us. And then we have been making investments, strategic investments to drive future growth that we feel very confident in and particularly around international and some of our marketing investments. That said, it’s going to take us longer to achieve the goals we communicated last October and we can provide I think a further update on our fourth quarter call. But we feel like we’ve got, again, all of the capabilities, tools, brands and people to get our earnings back over that $4 level. Chandana Madaka: Just as a follow-up. I wanted to ask if there’s anything more specific that you could discuss around the dynamics in China. What do you think is contributing to the softness there, is it more broadly macro and consumer spend? And just speak to your confidence in the region as you’re investing and opening more stores there. Jay Schmidt: We still believe that we have a significant growth opportunity in China and the rest of the world. While we’re somewhat more cautious on China in the near term, we believe it is an important market for us with significant long term opportunity. And we are looking at a more balanced approach with other markets being important well, as well such as the Middle East and EU. And even with our JV partner, we’re kind of looking at more moderate growth but still growing there. And then also that JV partner is expanding into Southeast Asia as well. So we think we have a good plan there but probably just our original China plan was probably too aggressive coming out of the gate. Operator: Our next question comes from the line of Laura Champine with Loop Capital Markets. Laura Champine: If I look at the shifts in the guidance, it doesn’t seem to be top line as much as it is op margin, and it’s our — perhaps that’s mostly on gross margin. How much of this is just more markdowns to clear inventory in Q4? And how impactful, if it’s impactful at all, is the [Technical Difficulty] [custom] called out in your press release today? Jack Calandra: So just in terms of as we look to Q4, we do expect a gross margin decline for the total company. That will be driven by a gross margin decline at brand portfolio where we plan to address the current but slow moving inventory that we talked about. And then in terms of the credit issue just a little background on that. We chose to suspend shipments to a customer given their aged receivables balance and their latest credit rating. We do expect continued challenges in Q4 and we have factored that into our guidance. And just rest assured that the age receivable balance was appropriately reserved for at the end of the third quarter, again, based on that value and that credit rating. Laura Champine: So that seems like more of a top line issue, and I wouldn’t expect a big markdown on receivables to impact margins in Q4. Is that fair? Jack Calandra: On the credit issue specifically? Laura Champine: Right, exactly. Jack Calandra: Yes. I mean, we do to the extent that we do any sales there, we have to also put up a pretty significant reserve for potential credit losses. So there is a bit of that offset that goes into the earnings flow through of that account. Laura Champine: And any framing you can give us around how large that customer is as a percentage of your wholesale business? Jack Calandra: It’s pretty small. And I can say as we think about the things that caused us to miss our top line in the third quarter, in the first one and the most significant one is the boots issue in both segments that Jay talked about. And then I think after that in terms of order would be the athletic, the late deliveries of the athletic product that we didn’t receive and then the credit issue would come below that. Laura Champine: So it sounds like you listed them in the press release and the order of their relative impact, which brings me to my final question. How large is China as a percentage of total sales at this point? Jack Calandra: No, it’s less than — I mean, the whole international piece is less than 5% of our total and China is the largest part of that but there are others there. So it is relatively low. It’s just that our plan was more aggressive than what we delivered against and that’s where it did catch us up on third quarter. Operator: Our next questions come from the line. If Mitch Kummetz with Seaport Research. Mitch Kummetz: I just want to start on 4Q, the implied guide there. Looks like kind of maybe the midpoint of the range sales down, I think 6%. Jack, can you remind us what the sales impact of the 53rd week was last year, maybe in total, and then how that’s split between Famous and BP? I assume it’s mostly, if not all, on the famous side. And when you look at that implied sales outlook, what are you assuming in terms of BP growth in the fourth quarter and then also Famous comp? Jack Calandra: So as a reminder, the impact of the 53rd week last year was $25 million in total for the company. And you rightly point out that most of that was in Famous, it was $18 million for Famous and $7 million for brand portfolio. So as we look for — look at sales, going forward into Q4 on a reported basis, so not adjusting for the 53rd week, we expect both segments to be down mid single digits. Adjusting for the 53rd week, we expect Famous to be down slightly but BP still to be down sort of in that mid single digit range, given the impact of the 53rd week wasn’t as significant and the plans that we have to make sure that we get through some of that current but slow moving inventory. So we finish the year clean from an inventory perspective. Mitch Kummetz : And on the Famous down slightly adjusted, I could probably try to back into some sort of comp assumption there. But maybe you could save me the trouble and kind of let me know what you’re thinking in terms of comp on that business. Jack Calandra: So for the Famous business, we’re looking at just a marginally positive comp, so about — call it about a 1 to 1.5 comp for Q4, which is obviously below where we finished in Q3. Mitch Kummetz: And then Jack, I think you mentioned in response to one of Laura’s questions that gross margin, you expect to be down in the fourth quarter. It looks like again, if I kind of take the midpoint of your guide, it looks like maybe op margin down around 70 basis points in 4Q. Can you say how much you expect gross margin to be down? And I assume maybe you’re assuming some SG&A deleverage as well. Jack Calandra: So really in terms of the op margin decline in Q4, more of it is being driven by gross margin. We do — just in terms of SG&A, we have the $12 million benefit from last year’s 53rd week. So obviously, that’s coming out of Q4. We do have some additional savings given the work that we’ve been doing. But just given what the sales are coming down, we think there is likely some deleverage in SG&A in the fourth quarter. So that reduction in operating margin really coming from both levers but I would say more so on the gross margin. Mitch Kummetz: And is your Famous comp your quarter-to-date, I don’t know, can you say anything about quarter to date at Famous? Is that sort of in line with that sort of plus 1% to 1.5% or is it below that and you expect that to pick up as the holiday season kicks in some more? Jack Calandra: Yes, I think it is running a bit below that. But because we have this compressed calendar for holiday, what we’re seeing certainly so far in the month of November is some very strong comps with that compressed holiday shopping period. So what we did was we compared sort of how we expect the quarter to build to the last time the calendar was like this, which was in 2018 and that gives us confidence in that forecast. Mitch Kummetz: And maybe just a last one. On the boots, you said it was the biggest negative impact on the third quarter. Is there any way to quantify that? I would imagine boots are more significant in 4Q. So are you expecting the impact to be more significant in the fourth quarter than the third quarter? Jay Schmidt: We’re seeing — boots did — it was about two thirds of our drop for the third quarter. We are — looking today at seeing the boot sales decline at least from what we know so far to be similar to what we’ve experienced in third quarter. And obviously, it’s just starting to turn very cold. So we’ll see if that gets improved. But right now, we can only guide on what we know. Operator: Our next question comes from the line of Dana Telsey with Telsey Advisory Group. Dana Telsey: As you think about the brand portfolio, what were the biggest brands where there was a rate of change, what decelerated, did anything accelerate in brand portfolio? And then if you think of the Famous Footwear business, what are you seeing there in terms of the health of that consumer? And it sounds like the FLAIR stores still outperform the base. Is it still 43 you’re looking for this year? And just lastly, with the promotions in this current fourth quarter, how do you expect them to be different? You mentioned BOGO before. What’s adjusting in the promotions in Famous Footwear or in brand portfolio as you go forward? Jay Schmidt: So starting off with what’s in the brand portfolio, as what’s called out the sneaker business. Fashion sneakers were very good and now represent 30% in the quarter. We had significant trends in footwear that were positive, such as flats, Mary Jane, slingbacks. And then also we did see a — although, it’s a smaller category for us within Boots, which got us to that better performance in tall boots, it was really on tall heel boots, which were very strong in the quarter. And both Sam Edelman and Naturalizer benefited from those trend items. Fast forward over to famous footwear, Athletic continues to really dominate right now. And these very strong athletic brands that we’ve reported upon that Famous does have are continuing to trend across the women’s, men’s and kids part of the business.  And then across the board, it really was boots that just — this particularly short casual that was the most concerning part and did cause us some pain here. Moving forward, we still see in — the consumers are still wanting the brands that they desire and that’s really whether they’re value or full price, they’re still really looking at the brands and the products that they want and continue to demand. So we’re continuing to see that. And then finally the FLAIR stores are working. We’re very happy with them. We’re only going to open one more store. So we have 32 open now so we’ll end with 33. And then right after the ’25 plan, we’ll continue to open more. We did delay some of those just so we could keep the stores open and get the most sales through the holiday period. Dana Telsey: And then just on that promotional part, Jay, how are you thinking about that, whether it’s BOGO [Indiscernible] how do you think of that as we go through the holiday season? Does it change at all? Jack Calandra: So in terms of Famous, we have a promotional calendar, which is very similar to last year where we did do a lot of BOGO promotion. And so we’ll continue that this year. So it should be pretty comparable year-over-year. I think where you’ll see more markdown activity, promotional activity is on the brand portfolio side. Again, as we look to exit 2024 with a really good position on inventory. And so that’s where I think you’ll see some more promotions and that’s where we have factored in some more gross margin, some more gross margin dilution in that business in Q4. Jay Schmidt: And it will be more clearance driven in that category, particularly in season. Jack Calandra: That’s right. Dana Telsey: And just one last thing. How much was the industry down versus your sales, was there a change in industry trend? Jack Calandra: So the total footwear industry in total was down about 1% [Multiple Speakers] in the quarter it was down 3%. And I think what we’ve seen is that the fashion segment of the industry has been below that and obviously that’s where we have a decent amount of exposure. So I would say both the overall footwear market and then I think the segments that we really compete in have been pressured. Operator: Thank you. That does conclude our question-and-answer session. I would now like to hand the call back to Jay Schmidt, President and CEO for closing remarks. Jay Schmidt: Okay. Thank you. Before we close today, I would like to thank the entire Caleres team for their focus and dedication during this quarter and for the whole year. Our team worked extremely hard during 2024 while laying the groundwork for a stronger 2025. Thank you all for joining us this morning and thank you for your continued interest in Caleres. Have a great day. Operator: Thank you. This does conclude today’s teleconference. We appreciate your participation. You may disconnect your lines at this time. Enjoy the rest of your day. Q3 2024NYSE:CALMSN NewsEarnings Call Transcript Returns since its inception in May 2014 (through February 19th, 2025) Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                                                                                             Get our editor’s daily picks straight in your inbox!"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Caleres Misses Q2 Sales Following Later Than Expected Back-to-School Sales Bump, Cuts Yearly Guidance",
    "link": "https://footwearnews.com/business/earnings/caleres-cal-q2-2024-earnings-miss-1203687937/",
    "published": "2024-09-12T07:00:00.000Z",
    "text": "The Pioneer Magnolia Spectator drops May 27 in a two nostalgic colorways with soft spikes and brogue detailing.\t Sign up for Footwear News straight to your inbox every day Only $24.99 for one year! Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2025 Fairchild Publishing, LLC. All Rights Reserved."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "CAL INVESTOR ALERT: Bronstein, Gewirtz and Grossman, LLC Announces an Investigation into Caleres, Inc. and Encourages Investors to Contact the Firm!",
    "link": "https://www.prnewswire.com/news-releases/cal-investor-alert-bronstein-gewirtz-and-grossman-llc-announces-an-investigation-into-caleres-inc-and-encourages-investors-to-contact-the-firm-302247813.html",
    "published": "2024-09-24T07:00:00.000Z",
    "text": "Searching for your content... \n                        In-Language News\n                     \nContact Us\n \n 888-776-0942\n\nfrom 8 AM - 10 PM ET\n Sep 24, 2024, 16:00 ET Share this article NEW YORK, Sept. 24, 2024 /PRNewswire/ -- Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC is investigating potential claims on behalf of purchasers of Caleres, Inc. (\"Caleres\" or \"the Company\") (NYSE: CAL). Investors who purchased Caleres securities are encouraged to obtain additional information and assist the investigation by visiting the firm's site: bgandg.com/CAL. Investigation Details On September 12, 2024, Caleres reported its second quarter of 2024 and that its sales were below analyst expectations. The Company also lowered its yearly guidance. Following this news, Caleres stock dropped more than 19% during intraday trading on the same day. What's Next? If you are aware of any facts relating to this investigation or purchased Caleres securities, you can assist this investigation by visiting the firm's site: bgandg.com/CAL. You can also contact Peretz Bronstein or his client relations manager, Nathan Miller, of Bronstein, Gewirtz & Grossman, LLC: 332-239-2660. There is No Cost to You We represent investors in class actions on a contingency fee basis. That means we will ask the court to reimburse us for out-of-pocket expenses and attorneys' fees, usually a percentage of the total recovery, only if we are successful. Why Bronstein, Gewirtz & Grossman Bronstein, Gewirtz & Grossman, LLC is a nationally recognized firm that represents investors in securities fraud class actions and shareholder derivative suits. Our firm has recovered hundreds of millions of dollars for investors nationwide. Attorney advertising. Prior results do not guarantee similar outcomes. Contact Bronstein, Gewirtz & Grossman, LLCPeretz Bronstein or Nathan Miller332-239-2660 | [email protected] SOURCE Bronstein, Gewirtz & Grossman, LLC Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC, a nationally recognized law firm, notifies investors that a class action lawsuit has been ... Attorney Advertising-- Bronstein, Gewirtz & Grossman, LLC, a nationally recognized law firm, notifies investors that a class action lawsuit has been... Banking & Financial Services Do not sell or share my personal information:"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Does Caleres (NYSE:CAL) Have A Healthy Balance Sheet?",
    "link": "https://simplywall.st/stocks/us/retail/nyse-cal/caleres/news/does-caleres-nysecal-have-a-healthy-balance-sheet-2",
    "published": "2024-12-05T08:00:00.000Z",
    "text": "Stock Analysis  Some say volatility, rather than debt, is the best way to think about risk as an investor, but Warren Buffett famously said that 'Volatility is far from synonymous with risk.'  So it might be obvious that you need to consider debt, when you think about how risky any given stock is, because too much debt can sink a company.  We can see that Caleres, Inc. (NYSE:CAL) does use debt in its business.  But the more important question is: how much risk is that debt creating?   Debt assists a business until the business has trouble paying it off, either with new capital or with free cash flow.  If things get really bad, the lenders can take control of the business.  However, a more frequent (but still costly) occurrence is where a company must issue shares at bargain-basement prices, permanently diluting shareholders, just to shore up its balance sheet.  Having said that, the most common situation is where a company manages its debt reasonably well - and to its own advantage.  The first thing to do when considering how much debt a business uses is to look at its cash and debt together.   View our latest analysis for Caleres   You can click the graphic below for the historical numbers, but it shows that Caleres had US$146.5m of debt in August 2024, down from US$244.0m, one year before.    However, it does have US$51.8m in cash offsetting this, leading to net debt of about US$94.7m.    We can see from the most recent balance sheet that Caleres had liabilities of US$860.4m falling due within a year, and liabilities of US$546.1m due beyond that.   On the other hand, it had cash of US$51.8m and US$156.3m worth of receivables due within a year.   So its liabilities outweigh the sum of its cash and (near-term) receivables by US$1.20b.     Given this deficit is actually higher than the company's  market capitalization of US$1.14b, we think shareholders really should watch Caleres's debt levels, like a parent watching their child ride a bike for the first time.  In the scenario where the company had to clean up its balance sheet quickly, it seems likely shareholders would suffer extensive dilution.    In order to size up a company's debt relative to its earnings, we calculate its net debt divided by its earnings before interest, tax, depreciation, and amortization (EBITDA) and its earnings before interest and tax (EBIT) divided by its interest expense (its interest cover).  This way, we consider both the absolute quantum of the debt, as well as the interest rates paid on it.   Caleres's net debt is only 0.39 times its EBITDA.  And its EBIT covers its interest expense a whopping 12.1 times over.  So you could argue it is no more threatened by its debt than an elephant is by a mouse.        On the other hand, Caleres saw its EBIT drop by 2.5% in the last twelve months.  If earnings continue to decline at that rate the company may have increasing difficulty managing its debt load.      When analysing debt levels, the balance sheet is the obvious place to start.  But ultimately the future profitability of the business will decide if Caleres can strengthen its balance sheet over time.  So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.    Finally, while the tax-man may adore accounting profits, lenders only accept cold hard cash.   So we always check how much of that EBIT is translated into free cash flow.    In the last three years, Caleres's free cash flow amounted to 49% of its EBIT, less than we'd expect.  That's not great, when it comes to paying down debt.     Even if we have reservations about how easily Caleres is capable of staying on top of its total liabilities, its interest cover and net debt to EBITDA make us think feel relatively unconcerned.       We think that Caleres's debt does make it a bit risky, after considering the aforementioned data points together.  That's not necessarily a bad thing, since leverage can boost returns on equity, but it is something to be aware of.      Given our hesitation about the stock, it would be good to know if Caleres insiders have sold any shares recently. You  click here to find out if insiders have sold recently.   If you're interested in investing in businesses that can grow profits without the burden of debt, then check out this free list of growing businesses that have net cash on the balance sheet.  Our new AI Stock Screener scans the market every day to uncover opportunities. • Dividend Powerhouses (3%+ Yield)• Undervalued Small Caps with Insider Buying• High growth Tech and AI CompaniesOr build your own from over 50 metrics. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Engages in the designs, develops, sources, manufactures, and distributes footwear in the United States, Canada, East Asia, and internationally. Flawless balance sheet, undervalued and pays a dividend. Financial Data provided by S&P Global Market Intelligence LLC, analysis provided by Simply Wall Street Pty Ltd. Copyright © 2025, S&P Global Market Intelligence LLC. All rights reserved. Markets Investing Ideas Features Simply Wall St Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. © 2025 Simply Wall Street Pty Ltd, US Design Patent #29/544/281, Community and European Design Registration #2845206"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Arizona woman suing Clayton-based Caleres for spying on her email activity",
    "link": "https://www.stltoday.com/news/local/business/arizona-woman-suing-clayton-based-caleres-for-spying-on-her-email-activity/article_6bc59b46-648d-11ef-8921-cf22573c360e.html",
    "published": "2024-08-27T07:00:00.000Z",
    "text": "Get the latest local business news delivered FREE to your inbox weekly. E-edition PLUS unlimited articles & videos Personalized news alerts with our mobile app *FREE access to newspapers.com archives Hundreds of games, puzzles & comics online *Refers to the latest 2 years of stltoday.com stories. Cancel anytime. The Caleres company headquarters, located at 8300 Maryland Avenye in Clayton, is photographed on Saturday, April 17, 2021.  An Arizona woman is accusing Clayton-based footwear company Caleres, Inc. of unlawfully spying on its email subscribers. In a class action lawsuit filed in St. Louis County’s Circuit Court on Aug. 21, Michelle Cummings, of Phoenix, claims that Caleres embeds hidden spy pixel trackers in its marketing emails without consent from recipients. Cummings subscribes to an email marketing list of Famous Footwear, one of Caleres’ shoe brands, and has opened promotional emails for over 10 years. According to the petition, these pixels track and log users’ reading habits and private information, like the time and place subscribers open and read their messages, how long they read the email, their location, IP address, device information, whether the email is forwarded or printed and more. Cummings is suing the company for violating Arizona’s Telephone, Utility and Communication Service Records Act, which prohibits procuring or attempting to procure the communication service records of email recipients without their authorization. “[Caleres] exploits this data to build customer profiles so it can sell and market more products to them,” the lawsuit reads. “Its recipients may be aware that they receive marketing emails, but they are not aware of, nor do they consent to, [Caleres’] surreptitious means of tracking their sensitive reading behavior.” The suit asks for $1,000 in damages for each of Caleres’ violations (each time the footwear company sent an email with spy pixels) or actual damages, whichever is more, and for damages equal to any profits Caleres made for each violation. Cummings also asks for a jury trial. Kelly Malone, company spokesperson, said Caleres does not comment on pending litigation. Caleres operates brands such as Famous Footwear, Sam Edelman and Dr. Scholl’s Shoes. The company is headquartered at 8300 Maryland Avenue. Top companies in St. Louis ranked by their revenue. Get the latest local business news delivered FREE to your inbox weekly. Retail Reporter   The CEO told investors that Caleres is restructuring, which he expects will save the company $7.5 million annually, and $2 million fiscal year…  Get up-to-the-minute news sent straight to your device."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Famous Footwear Parent, Caleres Inc., Posts Flat Sales in Q4 Despite Extra Week",
    "link": "https://sgbonline.com/caleres-2024-q4-update/",
    "published": "2024-03-19T07:00:00.000Z",
    "text": "Caleres, Inc., the parent of Famous Footwear and the Naturalizer, Vionic, Allen Edmonds, Blowfish Malibu, and Sam Edelman brands, eked out a slight increase in net sales for the 14-week period ended February 3, increasing just 0.1 percent to $697.1 million, compared to the 13-week fourth quarter ended January 28, 2023. The 14th week in fiscal 2023 added $25.0 million in sales. The Brand Portfolio reportedly capitalized on ongoing strength in its Lead Brands to power a 4.5 percent increase in year-over-year net sales and a 660 basis-point improvement in gross margin. Famous Footwear navigated a competitive market environment, capitalizing on pockets of holiday demand and delivering positive sales trends in its Kids business. Gross profit was $305.7 million for the fourth quarter, compared to $281.2 million in the prior-year quarter. Selling and administrative expenses were $272.8 million in the 2023 fourth quarter, compared to $255.3 million in the prior-year quarter. SG&A as a percentage of net sales was 39.1 percent. Net earnings of $55.8 million, or $1.57 per diluted share, compared to net earnings of $40.8 million, or $1.13 per diluted share, in the fourth quarter of fiscal 2022. Earnings per diluted share of $1.57 include: Adjusted net earnings were $30.8 million, or adjusted earnings per diluted share of 86 cents, for the quarter, compared to Adjusted net earnings of $23.4 million, or adjusted earnings per diluted share of 65 cents in the fourth quarter of fiscal 2022. “The Caleres team delivered another strong operational performance in the fourth quarter, culminating in a third consecutive year of adjusted earnings per share in excess of our $4.00 baseline and underscoring the durability of our earnings power,” said Jay Schmidt, president and CEO, Caleres, Inc. “Our fourth quarter results were led by our Brand Portfolio, which achieved a record-setting performance across key financial metrics. Complementing that strong result, Famous Footwear leaned into its competitive advantages to expand market share, particularly in Kids, which has outpaced the total business for 12 straight quarters.”  Fiscal Year 2023 Results\nConsolidated net sales were $2.82 billion for the 53-week period ended February 3 (fiscal 2023), compared to $2.97 billion in the 52-week period ended January 28, 2023 (fiscal 2022). The 53rd week in fiscal 2023 added $25.0 million in sales. Gross profit was $1.26 billion in fiscal 2023, compared to $1.28 billion in fiscal 2022. SG&A as a percentage of net sales was 37.7 percent. The Brand Portfolio segment also delivered its best-ever annual adjusted operating earnings, which topped $148 million and was accompanied by an 11.7 percent adjusted return on sales. Notably, the segment led the financial performance of the company. Net earnings were $171.4 million, or $4.80 per diluted share, for the year, compared to net earnings of $181.7 million, or $4.92 per diluted share, in fiscal 2022. Earnings of $4.80 per diluted share include: Adjusted net earnings were $149.3 million, or $4.18 per diluted share, compared to Adjusted net earnings of $167.1 million, or $4.52 per diluted share, in fiscal 2022. Earnings before interest, taxes, depreciation, and amortization (EBITDA) amounted to $253.5 million and Adjusted EBITDA of $259.6 million, or 9.2 percent of sales.  Balance Sheet\nInventory was down 6.8 percent at year-end, compared to fiscal year-end 2022, due to strategic inventory management, primarily in the Brand Portfolio segment; and Borrowings under the asset-based revolving credit facility were $182.0 million at the end of the period. Capital Allocation Update\nCaleres continued to reduce the borrowings under its asset-based revolving credit facility, paying down $40.0 million during the fourth quarter. The company also returned $2.5 million to shareholders through its quarterly dividend. In fiscal 2023, Caleres continued to invest in value-driving growth opportunities while at the same time reduced short-term borrowings by $125.5 million. The company ended fiscal 2023 with $182.0 million of borrowings. This represents its lowest total indebtedness since the fiscal first quarter 2010. In addition, Caleres returned $27.4 million to shareholders through share repurchases and dividend payments. Specifically, the company repurchased 763,000 shares of common stock, or approximately 2 percent of shares outstanding, for $17.4 million and an average price of $22.86 per share. The company returned $10.0 million to shareholders through quarterly dividend payments. “I am proud of the Caleres team and the tremendous progress we have made across a wide range of strategic objectives,” said Schmidt. “The transformation in earnings power that we have achieved in recent years – combined with our value-driving organizational structure, powerful brands, and best-in-class capabilities – positions us exceptionally well for growth in 2024 and beyond. Our Brand Portfolio, powered by our Lead Brands, has tremendous growth potential, and Famous is poised to strengthen its position as the No. 1 footwear destination for the Millennial family. Looking ahead, we are confident in our ability to execute on our growth strategy, deliver on our long-term financial targets, and create sustained value for our shareholders.” Fiscal 2024 Outlook\nThe company introduced its financial outlook for fiscal 2024 and the first quarter of 2024. Fiscal 2024 is a 52-week year and compares to a 53-week year in fiscal 2023. Caleres expects fiscal 2024 consolidated net sales to be flat to up 2 percent compared to 2023, and earnings per diluted share to be in the range of $4.30 to $4.60 per share. The company said the outlook considers and balances the positive momentum in the Brand Portfolio segment and ongoing companywide cost reduction initiatives against anticipated headwinds that include a forecasted decline in the footwear market, inflationary pressures that could affect consumer demand at Famous Footwear, and higher freight costs. In addition, for fiscal 2024, the company expects: For first quarter 2024, the company expects: Image courtesy Famous Footwear/Caleres, Inc. Follow us on: \n\nAmerican Athletic Conference Launches American RISE Ventures\n\nMay 27, 2025\n\n\n\n\n\n\nLife Time Life Opens Phase One of Indiana Athletic Club\n\nMay 27, 2025\n\n\n\n\n\n\nSavage Arms Makes Key Appointments to Leadership Team\n\nMay 27, 2025\n\n\n\n\n\n\nWalmart Restructures; Cuts Roughly 1,500 Corporate Jobs\n\nMay 22, 2025\n\n\n\n\n\n\nHoka and Ugg Parent Deckers Brands Names New Board of Directors Chair\n\nMay 22, 2025\n\n\n\n\n\n\nStrava to Acquire Cycling Training App\n\nMay 22, 2025\n\n\n\n\n\nDeckers Posts Fifth Straight Year of  Double-Digit Revenue and EPS Growth\n\nMay 22, 2025\n\n\n\n\n\n\nOn Elects Helena Helmersson to Board of Directors\n\nMay 22, 2025\n\n\n\n\n\nRoss Stores Sees Flat Q1 Comps, Withdraws FY Guidance On Tarrif Impact\n\nMay 22, 2025\n\n\n\n\n\n\nCole Haan to Launch Performance Golf Apparel Line Spring 2026\n\nMay 22, 2025\n\n\n\n\n\n\nZepp Health Corp. Sees DD Boost from Amazfit Brand in First Quarter  \n\nMay 22, 2025\n\n\n\n\n\n\nThe Picklr to Open 20 Clubs in Japan, with the First in Tokyo\n\nMay 22, 2025\n\n\n\n\n\n\nPickleball Kingdom Franchise to Open in Tinton Falls, New Jersey\n\nMay 22, 2025\n\n\n\n\n\n\nDillard’s Q1 Profits Dip on Slight Sales Decline\n\nMay 22, 2025\n\n\n\n\n\n\nPickleRage Expands Coast to Coast with Five New Franchisees\n\nMay 22, 2025\n\n\n\n\n Read More SGB Update Stories ©2025 SGB Media. All rights reserved. Use of this Site constitutes acceptance of our Terms & Conditions and Privacy Policy.The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of SGB Media."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Will Boots Boost Fall Biz? Here’s What Caleres, Genesco and Designer Brands Expect",
    "link": "https://footwearnews.com/business/business-news/caleres-genesco-designer-brands-boot-category-fall-1203688362/",
    "published": "2024-09-13T07:00:00.000Z",
    "text": "The Pioneer Magnolia Spectator drops May 27 in a two nostalgic colorways with soft spikes and brogue detailing.\t Sign up for Footwear News straight to your inbox every day Only $24.99 for one year! Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2025 Fairchild Publishing, LLC. All Rights Reserved."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "EXEC: Caleres Looks to Invest in Brand Portfolio Growth as Famous Footwear Struggles",
    "link": "https://sgbonline.com/caleres-looks-to-invest-in-brand-portfolio-growth-as-famous-footwear-struggles/",
    "published": "2024-03-19T07:00:00.000Z",
    "text": "Caleres, Inc. President and CEO Jay Schmidt said he was pleased to report that Caleres delivered another strong performance during the fourth quarter 2023, capping off the third straight year of adjusted earnings per share above the company’s $4.00 baseline as the company delivered $4.80 per diluted share for the fiscal 2023 full year, down from the $4.92 posting in fiscal 2022. Those comments and much more came during a quarterly conference call with analysts and the parent company of Famous Footwear and the Naturalizer, Vionic, Allen Edmonds, Blowfish Malibu, and Sam Edelman brands. “These results continue to underscore the power of our portfolio of brands, the focus of our talented team, and the magnitude of our structural financial transformation,” Schmidt asserted. Schmidt said 2023 was marked by “significant accomplishment and disciplined financial execution” as the company delivered annual sales of $2.82 billion, which was said to be in line with expectations. Gross profit was $305.7 million for the fourth quarter, compared to $281.2 million in the prior-year quarter. Consolidated gross margin was 43.9 percent of sales, a 310 basis-point improvement from the 2022 fourth quarter. Adjusted operating earnings were $201 million for the year, which Schmidt said generated a strong consolidated adjusted operating margin of more than 7 percent. “Our adjusted earnings per share of $4.18 was in line with the outlook we reaffirmed in January and we generated approximately $260 million in adjusted EBITDA,” he shared. “We are particularly proud of these results, which were achieved while navigating a dynamic demand environment and making prudent investments in support of our future growth.” Schmidt reported that the company had gained market share in both the Brand Portfolio in women’s fashion footwear and in Shoe Chains for Famous Footwear, as well as in Kids. “We leaned into our Edit to Win initiative and leading SPEED capabilities, which facilitated a nearly 7 percent reduction in inventory,” he added.” In taking a look at the fourth quarter ended February 3, which was a 14-week period on the NRF 4-5-4 calendar, Caleres delivered sales of $697.1 million, up 0.1 percent compared to the 13-week fourth quarter ended January 28, 2023. The 14th week in fiscal 2023 added $25.0 million in sales. Direct-to-consumer (DTC) sales represented approximately 74 percent of total net sales. “We generated strong margins, and we achieved fourth-quarter adjusted earnings per share of 86 cents, which represented a 32 percent increase over the fourth quarter of 2022,” he said. Brand Portfolio Segment\nThe Brand Portfolio reportedly delivered its best-ever annual adjusted operating earnings, which topped $148 million, eclipsing its previous record of $112 million. Schmidt said this was accompanied by a nearly 12 percent adjusted return on sales. Of particular note, the CEO said the Brand Portfolio segment led the financial performance of the company for the first time in nearly two decades. He said strong demand for the segment’s Lead Brands and largest portfolio brands drove the company’s performance. “Notably, sales in this segment were 4.5 percent higher than the fourth quarter of 2022, and segment gross margin increased significantly,” Schmidt detailed. “And while we invested in key capabilities like our marketing network and international expansion, most of the margin strength flowed through to the bottom line, leading to a 570 basis point improvement in adjusted quarterly operating margin. This strong upward momentum was broad-based, with increases across both our wholesale and direct channels, primarily our owned e-commerce, which increased 5 percent year-over-year.” He said the consumer continues prioritizing newness, including loafers, ballets, Mary Janes, slingbacks, and fashion sneakers. “Our brands were well-positioned to meet the diversified needs and preferences of our consumers,” he noted. “We saw particular strength across our Lead Brands during the last quarter of the year with positive trends in year-over-year sales, operating earnings and market share,” he said. “In total, these four brands, which include Sam Edelman, Allen Edmonds, Naturalizer, and Vionic, represented about 55 percent of the Brand Portfolio sales and more than half the segment’s operating earnings during the fourth quarter.” Sam Edelman reportedly had a solid quarter with improving financial metrics. Schmidt noted that Sam Edelman announced big news last week, unveiling Kylie Jenner as the face of its spring marketing campaign. “This is an exciting time for the Sam Edelman brand and team, which is celebrating its 20th anniversary this year,” he said. “The brand also continued to expand internationally, opening ten new stores in 2023, with plans to grow that number significantly in 2024.” He also said the company expected the 20th-anniversary marketing plans and events, international expansion with its joint venture partner in Asia, and the Sam and Libby brand relaunch would significantly drive sales in 2024 and beyond. Allen Edmonds turned in its 12th positive quarter of growth. Casual and sports styles continue to lead the way during the period, with the consumer responding to the newness and colorways of the brand’s iconic shoes and introducing new styles. “During the quarter, we opened a new Port Washington Studio concept store in Birmingham, AL,” Schmidt offered. “We now have eight Port Washington Studio stores and continue to see the sales performance outpace the rest of the chain. We already have plans to introduce the Port Washington Studio into four stores during 2024 and continue to look for more opportunities to add this concept to new and existing locations.” Naturalizer reportedly had a standout quarter from both a sales and margin perspective, Schmidt suggested. Sales were said to be up double digits and operating margin “improved substantially.” Schmidt said the Naturalizer brand gained 1 point of market share during the quarter with a significant increase in new consumers. “We are pleased with the rollout of the Naturalizer loyalty program, named Naturalizer Insider, and are seeing positive spending trends with loyalty members,” he added. “We are also seeing an increase in younger consumers, driven by strong relevant fashion offerings and targeted marketing efforts, including new collaborations and partnerships.” Vionic saw profitability improve significantly in the quarter, according to Schmidt’s review, saying that the upside came despite a modest decline in sales, with both the wholesale and e-commerce businesses making significant contributions. “Loafers, flats and sneakers drove the brand’s fourth-quarter business, and the Uptown Moc remains Vionic’s number one item,” he detailed. “In addition, our Rejuvenate Recovery slide sold very well, as did new styles in the walking category, with more to come in 2024.” Schmidt said the company’s largest portfolio brands also delivered outsized performances in the quarter. Dr. Scholl, Franco Sarto and LifeStride achieved year-over-year improvements in sales and earnings. “As we’ve noted, these brands play an important role in our overall portfolio, reaching different customer segments while generating meaningful profit and cash flow,” he said. This year, Dr. Scholl’s celebrates its 100th anniversary, with sales driving collaborations and partnerships. The first will be a collaboration with apparel brand Free People, which is set to drop in early April.” Brand Portfolio segment net sales increased 4.5 percent to $323.7 million. The 14th week in fiscal 2023 added $6.8 million in sales. Segment comparable store sales on a 13-week basis were down 3.8 percent in the fourth quarter, cycling a 20.4 percent comp sales increase in the prior-year quarter. Brand Portfolio segment gross margin of 42.6 percent of net sales, a 660 basis-point increase year-over-year. Overall, he said the Brand Portfolio performed at a high level during 2023, delivering its “best performance in portfolio history.” Schmidt reminded everyone on the call that the company continues to expect the Brand Portfolio to contribute about half of total sales and 60 percent of operating profit within the three-year period. “We are confident the Brand Portfolio, powered by its Lead Brands, is positioned to lead the financial performance of Caleres over the long term,” he declared. Famous Footwear Segment\nAt Famous Footwear, total sales declined 1.5 percent to $396.2 million, and comp sales declined 5.9 percent for the quarter on a 13-week basis, representing a sequential improvement in trend from the third-quarter period, both in-store and online. The 14th week in fiscal 2023 added $18.2 million in sales. Schmidt said traffic was down, and seasonal products, namely boots, represented “much of the sales decline.” “Famous, once again though, outperformed its competitive set, gaining market share in Shoe Chains,” he remarked. Famous Footwear segment gross margin was 42.9 percent of sales, 50 basis points better than the prior-year quarter. “During the holiday season, the consumer was motivated by highly demanded trend items instead of promotions,” Schmidt explained. “Robust selling on key athletic brands and styles and cozy products like slippers drove a modestly better sales trend during the seven-week holiday period. In addition, we were particularly pleased with the performance of our Kid’s business, where sales increased 2 percent year-over-year, and we gained 1.4 points of market share in Shoe Chains. As you know, we view Kids as our key differentiator and the entry point for the millennial family. Our Kid’s business has outpaced the rest of the chain for 12 consecutive quarters, and 2023 marked our highest level of annual Kids’ sales ever.” He said they were also pleased with the relative outperformance of women’s fashion and sales of key vertical brands, such as Naturalizer and Dr. Scholl’s, which were up year-over-year at Famous Footwear. “Over the last year, we’ve worked to drive a more balanced athletic versus fashion assortment, and we are making progress on that front,” he outlined. “Our vertical integration provides Famous with greater access to fashion products, a key growth driver for the business, as well as a greater ability to flex with trends and differentiate versus competitors. And vertical integration allows our own brands to reach new audiences. Our newest vertical brand, Sam and Libby, launched in Famous for Spring with solid early reads.” Lastly, Schmidt said the company continues to enhance the consumer experience at Famous Footwear. “We had 21 Flair stores open at the end of the quarter,” he shared. “The second wave of Flair stores have proven highly successful and are outperforming the chain and delivered positive year-over-year comps in the fourth quarter. We plan to continue to refine our approach to improving consumer experience to ensure we are realizing the highest return on this investment. We will transform an additional 23 stores to the Flair concept in 2024 and will have 44 Flair stores by year-end.” Schmidt wrapped up on Famous Footwear, saying the family footwear chain “performed well” in 2023. “The structural changes we’ve made across the business have enabled the Famous segment to maintain operating earnings and operating margin well above pre-pandemic levels, and we expect this to continue,” he said. “Looking ahead, we believe Famous Footwear is exceptionally well-positioned to compete and solidify its leadership position in the family channel.” Balance Sheet\nInventory at year-end was $541 million, down 6.8 percent versus the prior year-end, primarily in Brand Portfolio, reflecting a more normalized supply chain and disciplined inventory management across the business. By segment, inventory at Famous was up 2.5 percent versus the prior year, but down 4 percent when adjusted for the 53rd week. Brand Portfolio inventory was down 13.6 percent versus the prior year-end. “We feel good about the amount and composition of inventory with aged inventory down in both businesses in dollars and as a percent of the total,” said CFO Jack Calandra. “We generated $200 million of cash from operations and strategically used that cash to invest in and accelerate value-driving capabilities essential for our future growth,” added Schmidt. “This included enhancements to our marketing ecosystem, the expansion of our international presence, particularly at Sam Edelman, the involvement in consumer experience at Famous Footwear, and the upcoming go-live of our financial and operating system into a new integrated SAP platform. We also deployed cash to further strengthen our balance sheet and enhance our financial flexibility by reducing borrowings by $126 million from 2022. Finally, we returned more than $27 million to our shareholders through share repurchases and dividends.” Looking ahead, our capital allocation priorities remain consistent with what we’ve communicated previously. First, invest for organic growth, focusing on our Lead Brands and key capabilities. Second, maintain the dividend. Third, given the still elevated interest rates, we will continue to focus on reducing debt in the near term.  “As we said in Investor Day, by 2026, we expect borrowings to be less than $100 million and less than 0.5 turn of EBITDA. Fourth, share repurchases. Given our debt reduction progress and expectation for free cash flow in 2024, we have the opportunity to both reduce leverage and buy back shares. We will evaluate these alternatives in light of business performance and market conditions as we proceed through the year. We had 5.6 million shares remaining under our current Board authorization at year-end. “As we mentioned when we outlined our three-year plan last October, we don’t expect our growth to be linear, and embedded in that outlook was more modest growth in year one. In addition, our plan assumed that the overall footwear market would grow at 1 percent in 2024. Circana now expects a decline of 1 percent,” said Calandra. Including this adjustment and balancing the strong momentum in the company’s Brand Portfolio against anticipated headwinds, like inflationary pressures and higher freight costs, Caleres now expects sales to be flat to up 2 percent for 2024, which includes the impact of the 53rd week in 2023. Excluding the 53rd week, the company expects sales to be up 1 percent to 3 percent and earnings per diluted share in the $4.30 to $4.60 range. “We anticipate earnings to be up more in the first half than in the second half,” Calandra shared. “However, due to the timing of expenditures, including marketing for the Sam Edelman campaign and expense for the common platform implementation, we expect EPS to be down in Q1 and up in Q2.” Additionally, the company provided guidance on the following metrics for the full year: a consolidated operating margin of 7.3 percent to 7.5 percent, an effective tax rate of about 24 percent, and capital expenditures of $60 million to $70 million. For the first quarter Calandra said the company expects consolidated net sales to be flat to up 1 percent and earnings per diluted share in line with Q4 2023 on an adjusted basis. Image courtesy Allen Edmonds Follow us on: \n\nEXEC: Giant Group Posts 29 Percent Net Profit Decline; Sales Up 4.9 Percent\n\nMay 27, 2025\n\n\n\n\n\n\nEXEC: Go Sport and Al Mana Add Key Sporting Goods Execs\n\nMay 27, 2025\n\n\n\n\n\n\nEXEC: Norrøna Partners with Topsports for China Retail Presence\n\nMay 27, 2025\n\n\n\n\n\n\nEXEC: Deckers Shares Plunge on Weaker Hoka Growth in Q4 and Q1 Guide Miss\n\nMay 23, 2025\n\n\n\n\n\n\nEXEC: Tariff Worries Overhang NSGA Leadership Conference Energy\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Wilson Ball & Racquet Segment Continues DD Growth for Amer Sports\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Colt CZ Sees Robust Q1 Results; Acquires U.S.-Based Valley Steel Stamp\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Nike Rolls Out Price Increase Schedule\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Nike Brand Re-Engages with Amazon to Sell Direct to Customers\n\nMay 22, 2025\n\n\n\n\n\n\nEXEC: Arc’teryx Still King at Amer Sports But Growth Trend Moderates\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: VF Q4 Profits Beat Plan as TNF and Timberland Deliver Healthy Growth\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: Vans Hits Fiscal Q4 Turbulence as Brand Recovery Falters   \n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: New Hibbett Parent JD Sports Sees Shares Fall as Q1 Disappoints\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: Salomon Footwear Continues to Boost the Brand and Parent Amer Sports\n\nMay 21, 2025\n\n\n\n\n\n\nEXEC: Amer Sports C-Suite Details Small Tariff Impact and FY Guidance Bump\n\nMay 20, 2025\n\n\n\n\n Read More SGB Executive Stories ©2025 SGB Media. All rights reserved. Use of this Site constitutes acceptance of our Terms & Conditions and Privacy Policy.The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of SGB Media."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "School district says it will buy Caleres' Clayton HQ",
    "link": "https://www.ksdk.com/article/news/local/business-journal/caleres-clayton-hq-school-district/63-8325a740-2974-4b2a-80f9-0a9b8054d655",
    "published": "2024-01-02T08:00:00.000Z",
    "text": "CLAYTON, Mo. — The office campus of a footwear retailer, considered to be one of the prime redevelopment sites in Clayton, is slated to be purchased by the local school district for its own future expansion. The 9-acre headquarters of Caleres Inc. at 8300 Maryland Ave. will be sold as soon as mid-February to the School District of Clayton, which already operates Clayton High School on a neighboring property, pending due diligence, Clayton Superintendent Nisha Patel said Tuesday in a letter to Clayton parents. The sale comes with certain undisclosed closing conditions that have to be met and will include the entire campus, including 8400 Maryland Ave. and the Topton Way parking lot, Caleres President and CEO Jay Schmidt said in a statement. As part of the terms of the sale, Caleres could continue to operate from its offices up to 15 months after the closing date, Patel said. Click here to read the full story from the St. Louis Business Journal. A subscription is required.  To stream 5 On Your Side on your phone, you need the 5 On Your Side app. Next up in 5 Example video title will go here for this video Next up in 5 Example video title will go here for this video     In Other News"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Clayton's Furor Over Caleres Deal Has Gotten Ahead of the Facts",
    "link": "https://www.riverfronttimes.com/news/claytons-furor-over-caleres-deal-has-gotten-ahead-of-the-facts-41669833",
    "published": "2024-01-17T08:00:00.000Z",
    "text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. \nCloudflare Ray ID: 9466cc31485a3d2e\n•\n\n      Your IP:\n      Click to reveal\n2409:40f2:49:295d:ad7c:1c7d:beb:4c79\n•\n\nPerformance & security by Cloudflare"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Caleres Names Cole Haan Alum Erica Mackoul as SVP of International as Company Looks to Build Overseas",
    "link": "https://footwearnews.com/business/executive-moves/caleres-names-erica-mackoul-svp-of-international-1203561645/",
    "published": "2023-11-28T08:00:00.000Z",
    "text": "The Pioneer Magnolia Spectator drops May 27 in a two nostalgic colorways with soft spikes and brogue detailing.\t Sign up for Footwear News straight to your inbox every day Only $24.99 for one year! Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2025 Fairchild Publishing, LLC. All Rights Reserved."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Clayton school board backs out of buying Caleres property after backlash",
    "link": "https://www.stltoday.com/news/local/education/clayton-school-board-backs-out-of-buying-caleres-property-after-backlash/article_b40e4fd0-b969-11ee-a105-2b575808797b.html",
    "published": "2024-01-22T08:00:00.000Z",
    "text": "Get our local education coverage delivered directly to your inbox. E-edition PLUS unlimited articles & videos Personalized news alerts with our mobile app *FREE access to newspapers.com archives Hundreds of games, puzzles & comics online *Refers to the latest 2 years of stltoday.com stories. Cancel anytime. The Clayton School District struck a deal to buy the Caleres company headquarters, right, that is adjacent to Clayton High School, top left, for a plan called the Empowerment Campus Project as seen on Tuesday, Jan. 2, 2024. On Jan. 22, 2024 the district announced it was terminating the contract. CLAYTON — The Clayton Board of Education has terminated its contract to purchase the headquarters of global footwear company Caleres for $20.9 million after fierce backlash from the community. “Although a significant number of attendees at last week’s public forum expressed reservations about the acquisition, we also received strong support for moving forward with the purchase via emails, phone calls, and an online petition. We have listened carefully to all perspectives, recognizing they reflect diverse viewpoints and demographics within the Clayton community,” reads a letter sent Monday by the board. The school board will make it a priority to update its long-range facilities plan to reflect the district’s needs over the next 15 to 20 years, the letter said. Steph Kukuljan and other business reporters bring you insights into St. Louis-area real estate and development.  Caleres, formerly Brown Shoe Co., has for several years been trying to downsize from its 9-acre campus adjacent to Clayton High School. The property at 8300 Maryland Avenue includes 275,000 square feet over three buildings and is appraised by St. Louis County at $33.5 million. “Our campus is still being actively marketed for sale, and our goal remains the same — to provide a flexible, modern workspace that meets the evolving needs of our associates and business,” said Caleres president and CEO Jay Schmidt in a statement Monday. Michael Staenberg of The Staenberg Group real estate firm said Monday that he will continue to pursue a project at the site like the firm’s entertainment venue The Hub in Chesterfield. Clayton Schools Superintendent Nisha Patel listens on Wednesday, Jan. 17, 2024, during a public forum at Wydown Middle School for Clayton residents to address the board's vote to purchase the Caleres company headquarters building adjacent to the Clayton High School campus. Clayton Superintendent Nisha Patel announced on Jan. 2 that the school district would close on the property next month to create an “Empowerment Campus Project.” At a public forum Wednesday, school board members expressed varying ideas for the project, from a new football field to a performing arts center or even flipping it to a retail developer. A majority of attendees were critical of the board for the project’s lack of details and potential costs, while a handful of current teachers and parents said they were buoyed by the opportunity to compete with other districts and private schools with a new high-tech facility. Mayor Michelle Harris opposed the sale along with four former Clayton mayors. After the deal fell through, Harris said “the city of Clayton is 100% committed to continuing our historic partnership with the district, and appreciate any opportunity to be included in their long-term planning and land use discussions.” The Caleres property has annual real estate taxes of $1.3 million, of which the city of Clayton receives about 8% and the school district receives close to half. A hypothetical assessment of future commercial redevelopment of the site is estimated at $60 million, which would bring in $472,000 to the city and $2.7 million to the school district annually, according to city leaders. Clayton City Manager David Gipson has not responded to questions about how the hypothetical value was calculated. The highest-valued property in Clayton, the Pierre Laclede business center at 7701 and 7731 Forsyth Boulevard, is assessed at $30 million. At least two other potential sales of the Caleres property have collapsed in recent years. Local development firm Pier Property Group was slated to take over the campus until the deal fell through in October. Before that, Clayco’s realty arm CRG had a $500 million plan for the campus but backed out because the traffic and utilities improvements needed for the site would cost $15 million to $20 million, according to operating partner Jeff Tegethoff. Media personality Charlie Brennan, who led a group of residents in opposition to the sale, said Monday he was glad the deal fell through. “I hated to see the property taken off the tax rolls because I think both the city and the school district need the revenues,” Brennan said. “It was too expensive a purchase without a plan, and it really didn’t make too much sense. The city needs some retail tax dollars, something that would bring people together to make Clayton a little more lively.” Brown has been part of the corporate name since the company's founding in 1878. Next month, however, that name will be dropped once shareholders approve the change on May 28. (Post-Dispatch video) Get our local education coverage delivered directly to your inbox. Education reporter\t   Real estate and development\t   The CEO told investors that Caleres is restructuring, which he expects will save the company $7.5 million annually, and $2 million fiscal year… Opera Theatre plans to build a new performing arts center at the site, at Maryland Avenue and Topton Way off Interstate 170,   Get up-to-the-minute news sent straight to your device."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "4 former Clayton mayors ask school district to reconsider purchase of Caleres site",
    "link": "https://www.ksdk.com/article/news/local/business-journal/former-clayton-mayors-ask-school-district-to-reconsider-caleres-site-purchase/63-42f8d3ef-fbfd-443a-b5fc-2c6aee3f37e9",
    "published": "2024-01-08T08:00:00.000Z",
    "text": "CLAYTON, Mo. — Four former Clayton mayors have come out against the School District of Clayton’s plan to purchase a prime redevelopment site in the city. In a letter sent over the weekend to the Clayton Board of Education and Superintendent Nisha Patel, the four former mayors — Linda Goldstein, Harold Sanger, Hugh Scott and Ben Uchitelle — asked the school district to back off its pending acquisition of the 9-acre office campus of footwear retailer Caleres Inc., at 8300 Maryland Ave., calling it “unwise to the extreme” and saying it could “drive a serious wedge between the School District and your residents.” After at least two developers had the site under contract in the past 18 months and then dropped plans, with at least one attributing that decision to current economic conditions, the school district said last week it would purchase the site as soon as mid-February for an undisclosed price.  Click here to read the full story from the St. Louis Business Journal. A subscription is required. To stream 5 On Your Side on your phone, you need the 5 On Your Side app. Next up in 5 Example video title will go here for this video Next up in 5 Example video title will go here for this video     In Other News"
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Clayton School District plans to buy Caleres headquarters for undisclosed project",
    "link": "https://www.stltoday.com/news/local/business/clayton-school-district-plans-to-buy-caleres-headquarters-for-undisclosed-project/article_a6635e84-a9ab-11ee-9ef4-d38bfcae1506.html",
    "published": "2024-01-03T08:00:00.000Z",
    "text": "Get the latest local business news delivered FREE to your inbox weekly. E-edition PLUS unlimited articles & videos Personalized news alerts with our mobile app *FREE access to newspapers.com archives Hundreds of games, puzzles & comics online *Refers to the latest 2 years of stltoday.com stories. Cancel anytime. The Clayton School District struck a deal to buy the Caleres company headquarters, bottom, that is adjacent to Clayton High School, top left, for a plan called the Empowerment Campus Project as seen on Tuesday, Jan. 2, 2024. On Jan. 22, 2024 the district announced it was terminating the contract. CLAYTON — The Clayton School District is set to buy the Caleres company headquarters adjacent to Clayton High School for a plan called the Empowerment Campus Project. The cost of the 9-acre site at 8300 Maryland Avenue will be disclosed when the property closes in February, according to district officials. The current appraised value of the property, which the company has been trying to sell since 2021, is $33.5 million, according to St. Louis County records. If the deal goes through, St. Louis County stands to lose more than $1 million in annual tax revenue, current records show. Details on the district’s plans for the site are scarce, with Superintendent Nisha Patel saying “the exact scope of work will be determined over the coming months as part of a long-range facilities plan” in an email Tuesday to the community. Funds for the property will come from a 20-year financing plan using capital improvement funds, Patel said. The purchase agreement allows the company, which employs more than 400 in Clayton, to stay in the property for up to 15 months after closing, Patel said. Jay Schmidt, president and CEO of Caleres, confirmed the deal in a Tuesday email. Schmidt said the purchase includes the entire Caleres campus in Clayton, including 8300 and 8400 Maryland Avenue and the Topton Way parking lot. “Caleres has been an important corporate citizen of Clayton for more than 70 years, and we are pleased the sale will support the significant expansion of the Clayton School District footprint and positively impact the community,” Schmidt said in the statement. “Caleres is connected and committed to the Clayton community and our goal is to remain here in a modern and flexible workspace that meets the evolving needs of our business and corporate Associates.” Patel said additional updates about the school district’s plans for the property will be coming in the next few months. “As is the case with any ambitious undertaking, we will include all of our district community stakeholders, including our students, staff, parents, and community members,” Patel wrote in the email. “We also recognize that the City of Clayton is currently revisiting its comprehensive plan known as Clayton Tomorrow 2040 and we are committed to working with them to ensure both plans are complementary to one another.” But Clayton Mayor Michelle Harris said she is disappointed that the property will be sold to the school district. “We have the utmost respect for the school district and really value them as a partner,” Harris said Tuesday. “But this development is really not the best in terms of the health and long-term sustainability for the city of Clayton.” Harris says the city would miss out on tens of millions in property tax revenue over the next 20 years, and the school district itself would lose five times as much. Just as important as the revenue, Harris said, is the loss of energy downtown from a new retail, entertainment or residential project. “We hope the school district will try to partner with us to try to create more vitality there,” she said. Enrollment in Clayton schools is 2,427 in kindergarten through 12th grades this year, down 9% from a high of 2,681 students in 2018. Founded as Brown Shoe Co. in 1878, Caleres has been shopping its headquarters since 2021 with the goal of having a developer remake it while also cashing in on the competitive demand for Clayton’s real estate that often commands the highest prices in the region. But high interest rates have made developments more expensive and riskier and have affected nearly every commercial real estate deal in the country. Most recently, local development firm Pier Property Group was slated to take over the campus until the deal fell through in October. This was the second developer to drop the property; the first being real estate development firm CRG, which had a $500 million plan for the campus. Though Caleres reported its best financial year in 2022, the footwear brand reported a revenue of $761.9 million in earnings for third quarter 2023, down 4.6% from third quarter 2022. Mark Schmitt, Caleres’ senior vice president and chief logistics officer, has previously said in a statement that the company intends to stay in Clayton. Caleres operates through its Famous Footwear and Brand Portfolio segments. Steph Kukuljan of the Post-Dispatch contributed to this report. Brown has been part of the corporate name since the company's founding in 1878. Next month, however, that name will be dropped once shareholders approve the change on May 28. (Post-Dispatch video) Get the latest local business news delivered FREE to your inbox weekly. Education reporter\t   Retail Reporter   School district leaders say they won’t back off plans to buy the multi-million dollar property despite interest from retail developers. The district’s plans for the multi-million-dollar headquarters could include selling all or part of the property to a developer. The district’s plans for the multi-million-dollar headquarters could include selling all or part of the property to a developer. The planned “Empowerment Campus Project” for the Caleres property appraised at $33.5 million was met with swift backlash from civic leaders an… The Clayton School Board will decide by Monday to pursue the purchase after hosting a public forum where most residents opposed the plan. Monday was the deadline for the school district to terminate the contract with the global footwear company.  Get up-to-the-minute news sent straight to your device."
  },
  {
    "supplier": "Caleres, Inc.",
    "title": "Barclays PLC Acquires 29,057 Shares of Caleres, Inc. (NYSE:CAL)",
    "link": "https://www.defenseworld.net/2024/12/27/barclays-plc-acquires-29057-shares-of-caleres-inc-nysecal.html",
    "published": "2024-12-27T08:00:00.000Z",
    "text": "The article you are looking for could not be found (error 404). Here are a few options that might help you:"
  }
]